{"meta":{"title":"wsuper","subtitle":"","description":"","author":"文若","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"英语学习法","slug":"pagefengkuangdeshitou","date":"2020-04-12T11:23:44.000Z","updated":"2020-04-13T01:18:37.519Z","comments":true,"path":"2020/04/12/pagefengkuangdeshitou/","link":"","permalink":"http://yoursite.com/2020/04/12/pagefengkuangdeshitou/","excerpt":"","text":"为了进一步学习好英语，找到适合自己的英语学习方法。 特别查了一下一些学霸的英语学习方法。包括严峰老师、施一公老师。……","categories":[],"tags":[{"name":"英语","slug":"英语","permalink":"http://yoursite.com/tags/%E8%8B%B1%E8%AF%AD/"}]},{"title":"英语学习法","slug":"pageyingyuxuexifa","date":"2020-04-12T11:23:44.000Z","updated":"2020-04-13T01:22:18.966Z","comments":true,"path":"2020/04/12/pageyingyuxuexifa/","link":"","permalink":"http://yoursite.com/2020/04/12/pageyingyuxuexifa/","excerpt":"","text":"为了进一步学习好英语，找到适合自己的英语学习方法。 特别查了一下一些学霸的英语学习方法。包括严峰老师、施一公老师。","categories":[],"tags":[{"name":"英语","slug":"英语","permalink":"http://yoursite.com/tags/%E8%8B%B1%E8%AF%AD/"}]},{"title":"影评-茶馆","slug":"pagechaguan","date":"2020-04-12T09:15:07.000Z","updated":"2020-04-12T09:25:59.685Z","comments":true,"path":"2020/04/12/pagechaguan/","link":"","permalink":"http://yoursite.com/2020/04/12/pagechaguan/","excerpt":"","text":"世纪之交，古老的中国正迎来前所未有的巨大变革。老态龙钟的大清王朝摇摇欲坠，六君子的鲜血无法阻止历史车轮的滚动，老北京城的上空风云变幻，波谲云诡。王利发北京城内裕泰茶馆的年轻掌柜。他谨记父亲的教诲，体面周全地迎送四方宾客。小小的茶馆内，三教九流各色人等穿梭于此：提笼架鸟哀叹时运的松二爷；慨叹国之将亡的刚毅满人常四爷；一心谋求实业救国的秦仲义；丧尽天良买卖人口的刘麻子；打算娶老婆的庞太监…. 没有想到一部1982年的老片如此精彩，看完了只想说“太难了”。特别喜欢刚毅的常四爷，年轻的时候说：这大清国，是要完啊；中年的时候说：大清国到底是完了，该亡；老年的时候说：我爱我们的国啊！可谁爱我呀？悲哀的是，能干刚毅的常四爷，终究只能为自己捡几张纸钱，往空中一撒，时代的悲哀。所以吾辈更应珍惜今天来之不易的和平生活，列强亡我中华之心未灭，我们必须发奋图强，不负列祖列宗。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-断背山","slug":"pageduanbeishan","date":"2020-04-12T09:04:45.000Z","updated":"2020-04-12T09:14:46.277Z","comments":true,"path":"2020/04/12/pageduanbeishan/","link":"","permalink":"http://yoursite.com/2020/04/12/pageduanbeishan/","excerpt":"","text":"美国西部，沉默寡言的农夫恩尼斯和热情开朗的牛仔杰克一道被派到山上牧羊，那里人迹罕至，他们只有与羊群为伴，生活单调无味。一个天寒地冻的夜晚，在酒精与荷尔蒙的作用下，他们做了“不该做的事情”，也就此他们在断背山上度过了人生中最美好的时光。季节性放牧结束，迫于世俗压力，杰克和恩尼斯不舍地与对方分离并各自结婚生子。恩尼斯迎娶了自幼相识的阿尔玛，并有了两个可爱的女儿；杰克到了德州，在妻子露琳家族的扶植下事业顺利，还有了个儿子。虽然彼此真心相应，他们只能每年定期约会…. 因为是同志电影，所以一直没有看。因为前不久看了孤鸽镇，发现和本片有一些关系，看了发现原来是如此精彩的电影，一点也不恶心，原来男人与男人之间，也可以爱得这么唯美，是不是每个男人心中都有一座断背山？李安将一个动人的爱情故事讲述到了完美，深沉、细腻、柔和、感性，揉进了那么多东方欲说还休的矜持，让我一下子觉得，他们的世界离我是那么近如果一生不能和最爱的人渡过，那贫富喜怒又有什么区别，责任信仰又有什么意义。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-海边的曼彻斯特","slug":"pagehaibiandemachesite","date":"2020-04-12T08:36:58.000Z","updated":"2020-04-12T08:43:42.391Z","comments":true,"path":"2020/04/12/pagehaibiandemachesite/","link":"","permalink":"http://yoursite.com/2020/04/12/pagehaibiandemachesite/","excerpt":"","text":"李是一名颓废压抑的修理工，在得知哥哥乔伊去世的消息后，李回到了故乡——海边的曼彻斯特处理乔伊的后事。根据乔伊的遗嘱，李将会成为乔伊的儿子帕特里克的监护人，李打算将帕特里克带回波士顿，但很显然帕特里克并不愿意离开家乡和朋友们，但李亦不愿在这片伤心地久留。原来，曼彻斯特埋藏着李的一段绝望的回忆，他的过失使得两个女儿葬身火海，妻子兰迪亦因此而离开了他。此次重回故乡，李再度见到了已经再婚并且即将做妈妈的兰迪，与此同时，帕特里克那失踪已久的母亲艾丽斯亦联系上了帕特里克，希望他能够成为她的新家庭中的一员。 最悲痛的情节被小心翼翼的隐藏起来，一个悲伤到让人崩溃的故事，却被导演拍的波澜不惊，就如同片中角色对待这些事情的态度，埋入心底，只在独处的时候才重新拾起，默默舔舐伤口。主人公和侄子之间关系微妙的变化，让人深感家与亲人在我们感情中的分量之重；电影最后一幕，男主与侄子在海上垂钓，刺骨的海风没有半点温暖，每个人似乎保持着电影开始时的无奈和沮丧，也许这就是生活吧。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-绿皮书","slug":"pagelvpishu","date":"2020-04-12T08:23:51.000Z","updated":"2020-04-12T08:32:43.051Z","comments":true,"path":"2020/04/12/pagelvpishu/","link":"","permalink":"http://yoursite.com/2020/04/12/pagelvpishu/","excerpt":"托尼是一个吊儿郎当游手好闲的白人混混，在一家夜总会做侍者。这间夜总会因故要停业几个月，可托尼所要支付的房租和生活费不会因此取消，所以他的当务之急是去寻找另一份工作来填补这几个月的空缺。在这个节骨眼上，一位黑人钢琴家提出雇佣托尼。黑人音乐家即将开始为期八个星期的南下巡回演出，可是，那个时候南方对黑人的歧视非常的严重，于是托尼便成为了音乐家的司机兼保镖。一路上，两人迥异的性格使得他们之间产生了很多的矛盾，与此同时，音乐家在南方所遭受的种种不公平的对待也让托尼对种族歧视感到深恶痛绝。 赶走偏见不是靠鸣枪，赢得尊重不是靠拳。今年看过最好的剧情片之一。剧本扎实，细节充实，表演到位，但又因为主角角色的互换，在特定的时代和地域里散发出更强的乐趣。 以下是豆瓣摘抄。","text":"托尼是一个吊儿郎当游手好闲的白人混混，在一家夜总会做侍者。这间夜总会因故要停业几个月，可托尼所要支付的房租和生活费不会因此取消，所以他的当务之急是去寻找另一份工作来填补这几个月的空缺。在这个节骨眼上，一位黑人钢琴家提出雇佣托尼。黑人音乐家即将开始为期八个星期的南下巡回演出，可是，那个时候南方对黑人的歧视非常的严重，于是托尼便成为了音乐家的司机兼保镖。一路上，两人迥异的性格使得他们之间产生了很多的矛盾，与此同时，音乐家在南方所遭受的种种不公平的对待也让托尼对种族歧视感到深恶痛绝。 赶走偏见不是靠鸣枪，赢得尊重不是靠拳。今年看过最好的剧情片之一。剧本扎实，细节充实，表演到位，但又因为主角角色的互换，在特定的时代和地域里散发出更强的乐趣。 以下是豆瓣摘抄。 炸鸡梗。Tony向Shirley强势安利黑人爱吃的炸鸡，刚开始Shirley一脸嫌弃，后来翘着兰花指吃得超享受，再后来有一站巡演富丽堂皇的餐厅里端出来Shirley最爱的食物居然是炸鸡。 想挽留又不好意思说出口。有一站Tony遇到了纽约的朋友，用意大利语聊天，朋友诋毁黑人还说要给Tony介绍工作，他们都以为Shirley听不懂。结果晚上Tony出门去酒吧的时候，却被Shirley拦住。Shirley用意大利语夸奖了Tony还承诺要给他升职加薪。原来他都听得懂，是害怕Tony离开他，又不好意思直接挽留。Tony一下看穿他的心思，让他放心自己不会走。 警察蜀黍的反转。有一站的坏警察，因为歧视黑人扣押了Shirley和Tony。在平安夜他们回纽约的路上，又遇到了警察，本以为又遇上了麻烦，其实人家只是想提醒他们轮胎没气了，那句圣诞快乐的祝福在寒冷的雪夜显得格外温馨。 酒吧内外的反差。在最后一站的酒吧，Shirley一曲惊艳众人，又和黑人们默契配合演奏了流行音乐，打成一片，其乐融融，深处底层的黑人们貌似都接纳了这个身穿燕尾服的高雅“兄弟”。然而，一出门Tony的鸣枪却让人惊愕，原来不经意的露富被人盯上，两个黑人在撬车偷窃。朋友还是敌人，好人还是坏人，不能用肤色判断。 枪之迷。Tony有次假装有枪帮助Shirley脱离险境，Shirley说“我就知道你没有枪”。最后一站酒吧外，Tony鸣枪，Shirley说“我就知道你有枪”。 迟到的贵宾。Tony在平安夜终于赶到家，在热闹的家里却心不在焉，应该是在担心Shirley一个人太孤单吧。之后镜头切换到Shirley，他让管家回家过节后果然很孤，然后观众朋友们就热切地期盼，在一起在一起，要团圆要团圆！当Tony家的敲门声想起，大家都眼含热泪搓着手手期待看到Shirley，然而看到的却是当铺夫妇，大家跟着Tony一起失落，谁知后面居然站着羞涩的Shirley。 爱的代笔。Shirley帮Tony“润色”家书之后，Tony的妻子每每看得热泪盈眶，还超自豪地向亲朋好友炫耀，幸福感爆棚。然而最后她见到Shirley时，却悄悄在他耳边说了句感谢他的代笔。原来她一直知道，不过，虽然那些浪漫唯美的句子不是Tony的原创，其中流淌的情意却是真的。而且Tony耳濡目染，最后也掌握了写出浪漫家书的技巧。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-怦然心动","slug":"pagepengranxidong","date":"2020-04-12T08:09:21.000Z","updated":"2020-04-12T08:21:19.840Z","comments":true,"path":"2020/04/12/pagepengranxidong/","link":"","permalink":"http://yoursite.com/2020/04/12/pagepengranxidong/","excerpt":"","text":"布莱斯全家搬到小镇，邻家女孩朱丽前来帮忙。她对他一见钟情，心愿是获得他的吻。两人是同班同学，她一直想方设法接近他，但是他避之不及。她喜欢爬在高高的梧桐树上看风景，但因为施工，树被要被砍掉，她誓死捍卫，希望他并肩作战，但是他退缩了。她的事迹上了报纸，外公对她颇有好感，令他十分困惑。她凭借鸡下蛋的项目获得了科技展第一名，成了全场焦点，令他黯然失色。她把自家鸡蛋送给他，他听家人怀疑她家鸡蛋不卫生，便偷偷把鸡蛋丢掉。她得知真相，很伤心，两人关系跌入冰点。她跟家人诉说，引发争吵。原来父亲一直攒钱照顾傻弟弟，所以生活拮据。她理解了父母，自己动手，还得到了他外公的鼎力相助。他向她道歉，但是并未解决问题。他开始关注她。鸡蛋风波未平，家庭晚宴与午餐男孩评选又把两人扯在了一起。 虽然是讲小孩子早恋爱情故事。一对小孩，一棵树，特别简单的故事，讲得荡气回肠，看的人怦然心动。当你喜欢我的时候，我不喜欢你；当你爱上我的时候，我喜欢上你；当你离开我的时候，我却爱上你；是你走得太快，还是我跟不上你的脚步。女生十来岁就有超脱的自省意识，审视自己爱的人到底值不值得爱。一旦触及她的自尊，立刻决定放弃这个男生。只有双方尊重的基础上才能爱，现实中的成年人，有多少可以做到，有多少成年人甘愿做备胎去承受卑微的爱。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-猫鼠游戏","slug":"pagemaoshuyouxi","date":"2020-04-12T08:01:50.000Z","updated":"2020-04-12T08:08:26.097Z","comments":true,"path":"2020/04/12/pagemaoshuyouxi/","link":"","permalink":"http://yoursite.com/2020/04/12/pagemaoshuyouxi/","excerpt":"","text":"弗兰克（莱昂纳多·迪卡普里奥 ）是FBI有史以来年龄最小的通缉犯。他的犯罪手段神通广大，伪装身份的能力超乎常人，全美各地几乎都留下他的犯罪足迹。乔装医生、律师、飞行员，统统都是他曾经的身份。当然，弗兰克凭着这个“本领”，骗取了高达几百万的金额。活得逍遥快乐的弗兰克这次又成功伪造了一份学历证明，去医院做起了大夫。弗兰克不但在这里认识了护士布雷达，二人擦出爱火花，还通过布雷达的父亲得到了一份检察官助理的优差。然而，这只是暴风雨前夕——一双眼睛已经盯住了弗兰克，誓要把他绳之于法不可。这就是FBI探员卡尔。在研究追捕弗兰克的过程中，卡尔领教到这个犯罪天才的过人智商。他屡次被弗兰克这个黄毛小子捉弄，心里又恨又不得不佩服。 名字翻译的可真烂呀。电影非常好看，里面有很多有意思的经典桥段，小李子的美貌在这部电影中还是表现的挺淋漓尽致的，尤其是穿机长服时，简直帅爆非常棒的电影。即使电影有点长，依旧足够生动和吸引人看完，小李功不可没，演技足以撑起整部电影。电影虽然没有什么大场面，不过复古范儿很棒，非常难得和不易。作为一部犯罪片，传记片，却又足够温馨，足够有趣。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影片-情书","slug":"pageqingshu","date":"2020-04-12T07:55:53.000Z","updated":"2020-04-12T08:00:54.731Z","comments":true,"path":"2020/04/12/pageqingshu/","link":"","permalink":"http://yoursite.com/2020/04/12/pageqingshu/","excerpt":"","text":"除了电影，原著看过一遍，这可能就是暗恋的极致吧，也许每人都有似曾相似的故事，逝去了才追悔莫及。 某个飘雪的冬日，渡边博子在前未婚夫藤井树的三周年祭日上又一次悲痛到不能自已。正因为无法抑制住对已逝恋人的思念，渡边博子在其中学同学录里发现“藤井树” 在小樽市读书时的地址时，依循着寄发了一封本以为是发往天国的情书。不想不久渡边博子竟然收到署名为“藤井树”的回信，经过进一步了解，她知晓此藤井树是一个同她年纪相仿的女孩，且还是男友藤井树少年时代的同班同学。为了多了解一些昔日恋人在中学时代的情况，渡边博子开始与女性藤井树书信往来。而藤井树在不断的回忆中，渐渐发现少年时代与她同名同姓的那个藤井树曾对自己藏了一腔柔情。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-穿条纹睡衣的男孩","slug":"pagechuantiaowendenanhai","date":"2020-04-12T07:49:15.000Z","updated":"2020-04-12T07:54:56.775Z","comments":true,"path":"2020/04/12/pagechuantiaowendenanhai/","link":"","permalink":"http://yoursite.com/2020/04/12/pagechuantiaowendenanhai/","excerpt":"","text":"八岁男孩布鲁诺一家随着纳粹军官父亲的一纸调令，由柏林搬迁到了乡下。失去了朋友们的布鲁诺很快对新家附近的“农庄”产生了兴趣，那里有一群身穿“条纹睡衣”的人终日忙碌， 布鲁诺偷偷结识了铁丝网另一边的同龄男孩施穆尔，并时常带给他食物吃。在紧张的家庭氛围和姐姐向成人世界的变化中，施穆尔是布鲁诺惟一的朋友。某日布鲁诺决定，去铁丝网的另一边，以便见到施穆尔的父亲。 影片看到最后，都不敢看结局，太残忍，最后他成为了穿条纹睡衣的男孩。无论你之前是什么样的人，在穿上这件条纹睡衣之后，都会变成一样的人。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-海蒂与爷爷","slug":"pagehaidiyuyeye","date":"2020-04-12T07:34:30.000Z","updated":"2020-04-12T08:31:25.110Z","comments":true,"path":"2020/04/12/pagehaidiyuyeye/","link":"","permalink":"http://yoursite.com/2020/04/12/pagehaidiyuyeye/","excerpt":"","text":"海蒂自幼失去双亲，由海蒂的姨母照顾，后来由于姨妈要到外地工作，海蒂便去投靠住在阿尔卑斯山上的爷爷，爷爷性情古怪，跟村民不合，长久以来就离群索居，独自住在山区的木屋中，当海蒂来到爷爷家，她的纯真融化了爷爷的心。海蒂也交到一位新朋友牧童男孩彼得，他们一同徜徉在群山绿野之间，生活悠哉快活。后来海蒂却被迫离开山区，被送到法兰克福当一位不能走路的富家小姐克拉拉的玩伴，海蒂和克拉拉一拍即合，很快就成为形影不离的好友。而在克拉拉的祖母的鼓励之下，海蒂认字，因为阿尔卑斯山，海蒂又回到山上。克拉拉最后来山上看她，奇迹般的腿能站立了。 阿尔卑斯山的美景令人心醉，孩子表演自然纯真，用纯真的儿童视角看这个世界真心美好，勇敢，热爱生活。在大自然的力量下，所有偏见都可以化解，所有误会都可以原谅。被世界遗弃的孤儿，还能在阿尔卑斯山上快乐自由的奔跑。小海蒂露出门牙的微笑太迷人了，可以治愈人的童话故事。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-绝杀慕尼黑","slug":"pagejueshamunihei","date":"2020-04-12T07:12:51.000Z","updated":"2020-04-12T07:30:27.428Z","comments":true,"path":"2020/04/12/pagejueshamunihei/","link":"","permalink":"http://yoursite.com/2020/04/12/pagejueshamunihei/","excerpt":"","text":"电影根据体育历史中著名的传奇事件改编，讲述了1972年慕尼黑奥运会篮球决赛中，前苏联篮球队打败了保持了36年全胜纪录的美国队的传奇故事。整部影片觉得看的人热血喷张，菊花似紧。 教练太赞了。1） 专业过硬，因材施教，让球员相信自己，关键时候敢于决策；2）生活上除了给队员信任空间，尊重队员，用给自己孩子治病的钱救治队员，全员去参加婚礼、告诉打算叛逃的队员他在被监控……","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-地久天长","slug":"pagedijiutianchang","date":"2020-04-12T07:02:18.000Z","updated":"2020-04-12T07:10:11.173Z","comments":true,"path":"2020/04/12/pagedijiutianchang/","link":"","permalink":"http://yoursite.com/2020/04/12/pagedijiutianchang/","excerpt":"","text":"在电影中，刘家夫妇无疑是最大的无奈。在刘家妻子做完结扎后，自己孩子不幸溺死，这让这个家庭无疑是没了后路，当时的凄惨，那种心酸和无奈无疑成了这部电影中的最大泪点除了无尽的叹气，剩下的就是行尸走肉的生活，和一死了之的无奈。刘家因无法生育抱养的孩子，是一位叛逆心极强的孩子，最后他和一群“非主流”少年离家而去的时候，那种无奈的可怜是最令人揪心的，一面是无处安放的家庭，一面是家中的束缚，最后成为他离家出走的举动，实在令人牵挂。 在电影中，沈英明是一位富豪，不过这都是电影中改革后的事情了，而他的媳妇是一位抓计划生育的主任，在那个时候，而刘家夫妇本来逃了计划生育，却最后被沈家这位主任发现了，而当时刘家媳妇已经怀有身孕，就这样逼迫着刘家媳妇做了流产，结果流产时大出血，造成刘家媳妇不能再生孩子，而她却不以为然。可是命运就是如此的悲惨，刘家孩子不幸溺死，而罪魁祸首竟然是自己的孩子，这让她痛不欲生，毕竟她造成了刘家妻子的流产，不仅仅让她失去了腹中胎儿，而且永远不能生育，关键自己的孩子“害死”了刘家孩子，这份孽缘成了她死前也没法过去的坎，而沈家孩子成为了一位医生主任，虽然成功，但是一直压抑着孩子他玩伴的事情，也是痛不欲生。 沈家沈英明的妹子是位大美女，她深知哥哥一家对刘家造成了多大的损失，而自己又是喜欢刘大哥，于是她就想自己怀孕，有了孩子刘家抚养，但并破坏刘家夫妇的关系。而当她怀孕又想和刘家刘耀军结婚时，那种无知小女人的无奈，真的是令人又心疼。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评狗十三","slug":"pagegoushisan","date":"2020-04-12T06:54:37.000Z","updated":"2020-04-12T07:01:07.394Z","comments":true,"path":"2020/04/12/pagegoushisan/","link":"","permalink":"http://yoursite.com/2020/04/12/pagegoushisan/","excerpt":"李玩父母离异，父亲重新组建家庭，并有了一个儿子，李玩和爷爷奶奶生活，个性顽劣，但感情细腻。在自己的宠物狗丢失后与家人展开了激烈的“斗争”，父亲为此暴打了李玩。但在自己的小儿子被狗咬伤后，父亲处理的态度却截然相反，这让李玩受到了很大的打，面对父亲的专制威严，最终只有妥协 。还是让你蛮震撼的一部电影，列举下期中的台词吧。 1） 你知道人总是这样的，比如，今年过年我买了件绿毛衣，从交了钱的那一刻起我就开始后悔，红色的也好看啊。但要是买了红的，我肯定也后悔，对吧。就像，人在夏天，很难记起冬天有多冷，到了冬天，又忘了夏天有多热。你看，如果存在平行宇宙，这样的问题就好解决了。","text":"李玩父母离异，父亲重新组建家庭，并有了一个儿子，李玩和爷爷奶奶生活，个性顽劣，但感情细腻。在自己的宠物狗丢失后与家人展开了激烈的“斗争”，父亲为此暴打了李玩。但在自己的小儿子被狗咬伤后，父亲处理的态度却截然相反，这让李玩受到了很大的打，面对父亲的专制威严，最终只有妥协 。还是让你蛮震撼的一部电影，列举下期中的台词吧。 1） 你知道人总是这样的，比如，今年过年我买了件绿毛衣，从交了钱的那一刻起我就开始后悔，红色的也好看啊。但要是买了红的，我肯定也后悔，对吧。就像，人在夏天，很难记起冬天有多冷，到了冬天，又忘了夏天有多热。你看，如果存在平行宇宙，这样的问题就好解决了。 2） 在这个宇宙之外，一定还有无数个宇宙，包含着我们这个宇宙，所有可能性的总和。这样，我们的错误，就能在另一个宇宙被修正。 3）当能失去的都失去了，你也就差不多长大了。 4） 这样的事情，以后会更多。 5） 你见过真正的大人吗？ 6） 我刚才好怕它认出我过来，幸好没有。 7） 听你叔说话比你看啥书都管用 8） 孩子！哄哄就好了！ 9） “你看，这个孩子好懂事啊。” 10） “你怎么知道她是不是害怕、沉默、妥协呢？” 11） 原来我们都是这样长大的啊，没有怀孕、堕胎、出走、死亡，却看到自己展览了一场青春的斩首示众。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-心迷宫","slug":"pagexinmigong","date":"2020-04-12T06:42:58.000Z","updated":"2020-04-12T06:47:56.401Z","comments":true,"path":"2020/04/12/pagexinmigong/","link":"","permalink":"http://yoursite.com/2020/04/12/pagexinmigong/","excerpt":"","text":"这个电影绝对是个惊喜，从导演到演员都没有名气，投入应该也很少，虽然可以看出制作简陋，但电影很精彩。 影评剧透可以看豆瓣上的一篇评论。https://movie.douban.com/review/7627522/","categories":[],"tags":[{"name":"ganwu","slug":"ganwu","permalink":"http://yoursite.com/tags/ganwu/"}]},{"title":"影评-疯狂的赛车","slug":"pagefengkuangshaiche","date":"2020-04-12T06:19:31.000Z","updated":"2020-04-12T06:42:02.495Z","comments":true,"path":"2020/04/12/pagefengkuangshaiche/","link":"","permalink":"http://yoursite.com/2020/04/12/pagefengkuangshaiche/","excerpt":"","text":"感觉整体效果还可以。多条主线有序推进。 第一条主线，耿浩作为一名专业自行车赛车手，在一场自行车比赛中，阴差阳错的获得了银牌，获奖后接受了李法拉的采访，采访的过程中，耿浩喝下了李法拉提供的饮料，巧的是含有兴奋剂，更巧的是，喝完又参加了尿检，结果被终身禁赛，耿浩和他的师父有苦说不出。 第二条主线，泰国贩毒人员查猜哥，他的目的是和台湾黑帮团伙在大陆完成毒品交易。查猜哥手脚干净利落，杀死了某位自行车运动员，冒充了这位自行车运动员的身份，并把毒品藏在了车座底下。同时海上坐船来的台湾黑帮团伙也初显手脚，由于他们自己的“笨蛋理由”，误杀了好几个无辜的船员，从黑帮团伙出场来看，这伙人的智商算不上特别高。 第三条主线就是笨蛋盗贼团伙，这个团伙只有两个人。这两个笨蛋盗贼给整部电影带来了多大的笑料。这两个笨蛋贼也出现了很多经典的对话，诸如“满嘴顺口溜，你想考研啊？”，“你不想娶额妹，额还想娶你姐嘞”，最大的笑料是电影最后这两个贼误把警察认成了前来交易的毒贩子，一路跟着警察跑，最后把毒品双手捧给了他们以为的“毒贩子”。","categories":[],"tags":[{"name":"ganwu","slug":"ganwu","permalink":"http://yoursite.com/tags/ganwu/"}]},{"title":"影评-紫色","slug":"pagezise","date":"2020-04-12T03:21:55.000Z","updated":"2020-04-12T09:02:51.355Z","comments":true,"path":"2020/04/12/pagezise/","link":"","permalink":"http://yoursite.com/2020/04/12/pagezise/","excerpt":"","text":"故事发生在1909年的美国，西丽和南蒂是一对姐妹，虽然作为黑人女性她们必须面对残酷的现实，但有了彼此的陪伴，尚可苦中作乐，直到西丽被迫嫁给了黑人男子亚伯特。亚伯特性格粗暴，对于他来说，西丽比一个女佣好不了多少，动辄拳打脚踢，他真心爱着的是一个远在他乡的叫做夏戈的女演员。南蒂前来陪伴西丽，亚伯特却因强暴她未遂而将她赶出家门，这一别，西丽彻底的失去了南蒂的音讯。在苦闷的生活中，女人们试图挣扎和抵抗，但最终无一例外的都屈服于歧视和强权之下，夏戈的到来改变了这一切，她独立坚强，从不因为自己女性的身份而有所畏惧，她的乐观给了西丽反抗的勇气，终于，她拿起行李离开了亚伯特，成立了自己的裁缝店，生意红火。而突然有一天，南蒂和自己幸福的家庭再一次出现在了西丽的眼前，出现在了那篇紫色的花海之中。 这是一部有关反抗的片子。黑人女性对黑人男性，黑人青年男性对黑人老年男性，黑人对白人的反抗。女性的觉醒之路，女主的服从、同化到最后的反抗，看得很过瘾。西丽是骄傲的反抗者，在经历被迫害后开始一蹶不振最后又重拾反抗的勇气。夏戈珍惜女性同胞，能认出被压迫的人，愿意解救被压迫的人，是一个拎的清的人。南蒂从小就是那种知道认清事实然后学会反抗，重要的是提升能力才有底气和资本反抗。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"亚瑟.阿伦的36问","slug":"page36wen","date":"2020-04-12T03:19:22.000Z","updated":"2020-04-12T03:20:49.204Z","comments":true,"path":"2020/04/12/page36wen/","link":"","permalink":"http://yoursite.com/2020/04/12/page36wen/","excerpt":"","text":"1、如果可以跟世上任何人共进晚餐，你会选择谁？ 2、你会想出名吗？以什么样方式出名呢？ 3、在打一通电话之前，你会先排演要在电话中说什么吗？为什么？ 4、你心中最完美的一天是做哪些事呢？ 5、你上一次唱歌给自己听是什么时候？上一次唱给别人听又是何时？ 6、如果你可以活到90岁，并能在30岁过后让体态或大脑一直保持30岁的状态到死，你会选保持体态还是大脑呢？ 7、你有曾经预感过自己会怎么死亡吗？ 8、举出3个你与你对面这位的共同点。 9、你人生中你最感激什么？ 10、如果你能改变你是怎么被抚育成人的，你会想改变什么？ 11、用四分钟跟你对面这位分享你的一生，越详细越好。 12、如果你明早一觉醒来发现自己获得了某种能力，你希望是什么能力？ 13、如果一颗魔法水晶球能告诉你有关你自己，你的人生，你的未来，或任何事情，你会想知道什么？ 14、你有已经梦想了很久，想做的事情吗？你为什么还没去做？ 15、你人生中最大的成就是什么？ 16、一段友情中你最珍视的是什么？ 17、你最珍贵的一段回忆是什么？ 18、你最糟糕的一段回忆是什么？ 19、如果你知道你会在一年后突然死去，你会想改变任何你现在的生活方式吗？为什么？ 20、友情对你来说代表什么？ 21、爱与喜欢在你的人生中有着什么样的地位？ 22、轮流分享你觉得你的恋人应该具有的五项好品质？ 23、你的家庭亲密温暖吗？你觉得你的童年有比别人幸福点吗？ 24、你觉得你跟你的母亲的关系怎么样呢？ 25、用“我们“做主语造三个肯定句，比如“我们都在这个房间里”。 26、完成以下句子“我希望我有一个人能与ta分享…” 27、如果你会跟你对面的人变成亲密好友，分享一下你觉得对方必需得知道的事情。 28、告诉你对面的人你喜欢ta什么：老实回答，说一些你通常不会告诉刚认识的人的答案。 31、告诉你对面的人你已经喜欢上ta的什么？ 32、有什么人事物是太严重，不能随便开玩笑的？ 33、如果你将在今晚死去，没有任何再与他人交流的机会，你最后悔没有把什么事情跟别人说？ 34、你的家着火了，里面有你所拥有的一切事物、在救出你爱的人，你的宠物后，你还有时间最后再冲回去一趟拯救最后一样任何东西，你会救出什么？为什么？ 35、你家庭中的所有人里，谁的死会让你最难受？为什么？ 36、分享一个你私人的问题，并想你对面的人询问ta会怎么处理、之后再请ta回答，对于你选这个问题，ta有什么看法？","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"提问的智慧","slug":"howToAsk","date":"2020-04-12T03:19:22.000Z","updated":"2020-04-12T06:50:27.523Z","comments":true,"path":"2020/04/12/howToAsk/","link":"","permalink":"http://yoursite.com/2020/04/12/howToAsk/","excerpt":"本文转自：https://github.com/ryanhanwu/How-To-Ask-Questions-The-Smart-Way How To Ask Questions The Smart Way本指南英文版版权为 Eric S. Raymond, Rick Moen 所有。原文网址：http://www.catb.org/~esr/faqs/smart-questions.html Copyleft 2001 by D.H.Grand(nOBODY/Ginux), 2010 by Gasolin, 2015 by Ryan Wu本中文指南是基于原文 3.10 版以及 2010 年由 https://github.com/gasolin 所翻译版本的最新翻译 目录 声明 简介 在提问之前 当你提问时 慎选提问的论坛 Stack Overflow 网站和 IRC 论坛 第二步，使用项目邮件列表 使用有意义且描述明确的标题 使问题容易回复 用清晰、正确、精准并合法语法的语句 使用易于读取且标准的文件格式发送问题 精确地描述问题并言之有物 话不在多而在精 别动辄声称找到 Bug 低声下气不能代替你的功课 描述问题症状而非你的猜测 按发生时间先后列出问题症状 描述目标而不是过程 别要求使用私人电邮回复 清楚明确的表达你的问题以及需求 询问有关代码的问题时 别把自己家庭作业的问题贴上来 去掉无意义的提问句 即使你很急也不要在标题写紧急 礼多人不怪，而且有时还很有帮助 问题解决后，加个简短的补充说明 如何解读答案 RTFM 和 STFW：如何知道你已完全搞砸了 如果还是搞不懂 处理无礼的回应 如何避免扮演失败者 不该问的问题 好问题与蠢问题 如果得不到回答 如何更好地回答问题 相关资源 鸣谢 声明许多项目在他们的使用协助/说明网页中链接了本指南，这么做很好，我们也鼓励大家都这么做。但如果你是负责管理这个项目网页的人，请在超链接附近的显著位置上注明： 本指南不提供此项目的实际支持服务！ 我们已经深刻领教到少了上述声明所带来的痛苦。因为少了这点声明，我们不停地被一些白痴纠缠。这些白痴认为既然我们发布了这本指南，那么我们就有责任解决世上所有的技术问题。 如果你是因为需要某些协助而正在阅读这本指南，并且最后离开是因为发现从本指南作者们身上得不到直接的协助，那么你就是我们所说的那些白痴之一。别问我们问题，我们只会忽略你。我们在这本指南中是教你如何从那些真正懂得你所遇到软件或硬件问题的人取得协助，而 99% 的情况下那不会是我们。除非你确定本指南的作者之一刚好是你所遇到的问题领域的专家，否则请不要打扰我们，这样大家都会开心一点。 简介不只是黑客，现在开源（Open Source）软件已经相当盛行，你常常也可以由其他有经验的使用者身上得到好答案，这是件好事；使用者比起黑客来，往往对那些新手常遇到的问题更宽容一些。然而，将有经验的使用者视为黑客，并采用本指南所提的方法与他们沟通，同样也是能从他们身上得到满意回答的最有效方式。 首先你应该明白，黑客们喜爱有挑战性的问题，或者能激发他们思维的好问题。如果我们并非如此，那我们也不会成为你想询问的对象。如果你给了我们一个值得反复咀嚼玩味的好问题，我们自会对你感激不尽。好问题是激励，是厚礼。好问题可以提高我们的理解力，而且通常会暴露我们以前从没意识到或者思考过的问题。对黑客而言，”好问题！”是诚挚的大力称赞。 尽管如此，黑客们有着蔑视或傲慢面对简单问题的坏名声，这有时让我们看起来对新手、无知者似乎较有敌意，但其实不是那样的。 我们不讳言我们对那些不愿思考、或者在发问前不做他们该做的事的人的蔑视。那些人是时间杀手 —— 他们只想索取，从不付出，消耗我们可用在更有趣的问题或更值得回答的人身上的时间。我们称这样的人为 失败者（撸瑟） （由于历史原因，我们有时把它拼作 lusers）。 我们意识到许多人只是想使用我们写的软件，他们对学习技术细节没有兴趣。对大多数人而言，电脑只是种工具，是种达到目的的手段而已。他们有自己的生活并且有更要紧的事要做。我们了解这点，也从不指望每个人都对这些让我们着迷的技术问题感兴趣。尽管如此，我们回答问题的风格是指向那些真正对此有兴趣并愿意主动参与解决问题的人，这一点不会变，也不该变。如果连这都变了，我们就是在降低做自己最擅长的事情上的效率。 我们（在很大程度上）是自愿的，从繁忙的生活中抽出时间来解答疑惑，而且时常被提问淹没。所以我们无情的滤掉一些话题，特别是拋弃那些看起来像失败者的家伙，以便更高效的利用时间来回答赢家（winner）的问题。 如果你厌恶我们的态度，高高在上，或过于傲慢，不妨也设身处地想想。我们并没有要求你向我们屈服 —— 事实上，我们大多数人非常乐意与你平等地交流，只要你付出小小努力来满足基本要求，我们就会欢迎你加入我们的文化。但让我们帮助那些不愿意帮助自己的人是没有效率的。无知没有关系，但装白痴就是不行。 所以，你不必在技术上很在行才能吸引我们的注意，但你必须表现出能引导你变得在行的特质 – 机敏、有想法、善于观察、乐于主动参与解决问题。如果你做不到这些使你与众不同的事情，我们建议你花点钱找家商业公司签个技术支持服务合同，而不是要求黑客个人无偿地帮助你。 如果你决定向我们求助，当然你也不希望被视为失败者，更不愿成为失败者中的一员。能立刻得到快速并有效答案的最好方法，就是像赢家那样提问 – 聪明、自信、有解决问题的思路，只是偶尔在特定的问题上需要获得一点帮助。 （欢迎对本指南提出改进意见。你可以 email 你的建议至 esr@thyrsus.com 或 respond-auto@linuxmafia.com。然而请注意，本文并非网络礼节的通用指南，而我们通常会拒绝无助于在技术论坛得到有用答案的建议）。","text":"本文转自：https://github.com/ryanhanwu/How-To-Ask-Questions-The-Smart-Way How To Ask Questions The Smart Way本指南英文版版权为 Eric S. Raymond, Rick Moen 所有。原文网址：http://www.catb.org/~esr/faqs/smart-questions.html Copyleft 2001 by D.H.Grand(nOBODY/Ginux), 2010 by Gasolin, 2015 by Ryan Wu本中文指南是基于原文 3.10 版以及 2010 年由 https://github.com/gasolin 所翻译版本的最新翻译 目录 声明 简介 在提问之前 当你提问时 慎选提问的论坛 Stack Overflow 网站和 IRC 论坛 第二步，使用项目邮件列表 使用有意义且描述明确的标题 使问题容易回复 用清晰、正确、精准并合法语法的语句 使用易于读取且标准的文件格式发送问题 精确地描述问题并言之有物 话不在多而在精 别动辄声称找到 Bug 低声下气不能代替你的功课 描述问题症状而非你的猜测 按发生时间先后列出问题症状 描述目标而不是过程 别要求使用私人电邮回复 清楚明确的表达你的问题以及需求 询问有关代码的问题时 别把自己家庭作业的问题贴上来 去掉无意义的提问句 即使你很急也不要在标题写紧急 礼多人不怪，而且有时还很有帮助 问题解决后，加个简短的补充说明 如何解读答案 RTFM 和 STFW：如何知道你已完全搞砸了 如果还是搞不懂 处理无礼的回应 如何避免扮演失败者 不该问的问题 好问题与蠢问题 如果得不到回答 如何更好地回答问题 相关资源 鸣谢 声明许多项目在他们的使用协助/说明网页中链接了本指南，这么做很好，我们也鼓励大家都这么做。但如果你是负责管理这个项目网页的人，请在超链接附近的显著位置上注明： 本指南不提供此项目的实际支持服务！ 我们已经深刻领教到少了上述声明所带来的痛苦。因为少了这点声明，我们不停地被一些白痴纠缠。这些白痴认为既然我们发布了这本指南，那么我们就有责任解决世上所有的技术问题。 如果你是因为需要某些协助而正在阅读这本指南，并且最后离开是因为发现从本指南作者们身上得不到直接的协助，那么你就是我们所说的那些白痴之一。别问我们问题，我们只会忽略你。我们在这本指南中是教你如何从那些真正懂得你所遇到软件或硬件问题的人取得协助，而 99% 的情况下那不会是我们。除非你确定本指南的作者之一刚好是你所遇到的问题领域的专家，否则请不要打扰我们，这样大家都会开心一点。 简介不只是黑客，现在开源（Open Source）软件已经相当盛行，你常常也可以由其他有经验的使用者身上得到好答案，这是件好事；使用者比起黑客来，往往对那些新手常遇到的问题更宽容一些。然而，将有经验的使用者视为黑客，并采用本指南所提的方法与他们沟通，同样也是能从他们身上得到满意回答的最有效方式。 首先你应该明白，黑客们喜爱有挑战性的问题，或者能激发他们思维的好问题。如果我们并非如此，那我们也不会成为你想询问的对象。如果你给了我们一个值得反复咀嚼玩味的好问题，我们自会对你感激不尽。好问题是激励，是厚礼。好问题可以提高我们的理解力，而且通常会暴露我们以前从没意识到或者思考过的问题。对黑客而言，”好问题！”是诚挚的大力称赞。 尽管如此，黑客们有着蔑视或傲慢面对简单问题的坏名声，这有时让我们看起来对新手、无知者似乎较有敌意，但其实不是那样的。 我们不讳言我们对那些不愿思考、或者在发问前不做他们该做的事的人的蔑视。那些人是时间杀手 —— 他们只想索取，从不付出，消耗我们可用在更有趣的问题或更值得回答的人身上的时间。我们称这样的人为 失败者（撸瑟） （由于历史原因，我们有时把它拼作 lusers）。 我们意识到许多人只是想使用我们写的软件，他们对学习技术细节没有兴趣。对大多数人而言，电脑只是种工具，是种达到目的的手段而已。他们有自己的生活并且有更要紧的事要做。我们了解这点，也从不指望每个人都对这些让我们着迷的技术问题感兴趣。尽管如此，我们回答问题的风格是指向那些真正对此有兴趣并愿意主动参与解决问题的人，这一点不会变，也不该变。如果连这都变了，我们就是在降低做自己最擅长的事情上的效率。 我们（在很大程度上）是自愿的，从繁忙的生活中抽出时间来解答疑惑，而且时常被提问淹没。所以我们无情的滤掉一些话题，特别是拋弃那些看起来像失败者的家伙，以便更高效的利用时间来回答赢家（winner）的问题。 如果你厌恶我们的态度，高高在上，或过于傲慢，不妨也设身处地想想。我们并没有要求你向我们屈服 —— 事实上，我们大多数人非常乐意与你平等地交流，只要你付出小小努力来满足基本要求，我们就会欢迎你加入我们的文化。但让我们帮助那些不愿意帮助自己的人是没有效率的。无知没有关系，但装白痴就是不行。 所以，你不必在技术上很在行才能吸引我们的注意，但你必须表现出能引导你变得在行的特质 – 机敏、有想法、善于观察、乐于主动参与解决问题。如果你做不到这些使你与众不同的事情，我们建议你花点钱找家商业公司签个技术支持服务合同，而不是要求黑客个人无偿地帮助你。 如果你决定向我们求助，当然你也不希望被视为失败者，更不愿成为失败者中的一员。能立刻得到快速并有效答案的最好方法，就是像赢家那样提问 – 聪明、自信、有解决问题的思路，只是偶尔在特定的问题上需要获得一点帮助。 （欢迎对本指南提出改进意见。你可以 email 你的建议至 esr@thyrsus.com 或 respond-auto@linuxmafia.com。然而请注意，本文并非网络礼节的通用指南，而我们通常会拒绝无助于在技术论坛得到有用答案的建议）。 在提问之前在你准备要通过电子邮件、新闻群组或者聊天室提出技术问题前，请先做到以下事情： 尝试在你准备提问的论坛的旧文章中搜索答案。 尝试上网搜索以找到答案。 尝试阅读手册以找到答案。 尝试阅读常见问题文件（FAQ）以找到答案。 尝试自己检查或试验以找到答案。 向你身边的强者朋友打听以找到答案。 如果你是程序开发者，请尝试阅读源代码以找到答案。 当你提出问题的时候，请先表明你已经做了上述的努力；这将有助于树立你并不是一个不劳而获且浪费别人的时间的提问者。如果你能一并表达在做了上述努力的过程中所学到的东西会更好，因为我们更乐于回答那些表现出能从答案中学习的人的问题。 运用某些策略，比如先用 Google 搜索你所遇到的各种错误信息（既搜索 Google 论坛，也搜索网页），这样很可能直接就找到了能解决问题的文件或邮件列表线索。即使没有结果，在邮件列表或新闻组寻求帮助时加上一句 我在 Google 中搜过下列句子但没有找到什么有用的东西 也是件好事，即使它只是表明了搜索引擎不能提供哪些帮助。这么做（加上搜索过的字串）也让遇到相似问题的其他人能被搜索引擎引导到你的提问来。 别着急，不要指望几秒钟的 Google 搜索就能解决一个复杂的问题。在向专家求助之前，再阅读一下常见问题文件（FAQ）、放轻松、坐舒服一些，再花点时间思考一下这个问题。相信我们，他们能从你的提问看出你做了多少阅读与思考，如果你是有备而来，将更有可能得到解答。不要将所有问题一股脑拋出，只因你的第一次搜索没有找到答案（或者找到太多答案）。 准备好你的问题，再将问题仔细的思考过一遍，因为草率的发问只能得到草率的回答，或者根本得不到任何答案。越是能表现出在寻求帮助前你为解决问题所付出的努力，你越有可能得到实质性的帮助。 小心别问错了问题。如果你的问题基于错误的假设，某个普通黑客（J. Random Hacker）多半会一边在心里想着蠢问题…， 一边用无意义的字面解释来答复你，希望着你会从问题的回答（而非你想得到的答案）中汲取教训。 绝不要自以为够格得到答案，你没有；你并没有。毕竟你没有为这种服务支付任何报酬。你将会是自己去挣到一个答案，靠提出有内涵的、有趣的、有思维激励作用的问题 —— 一个有潜力能贡献社区经验的问题，而不仅仅是被动的从他人处索取知识。 另一方面，表明你愿意在找答案的过程中做点什么是一个非常好的开端。谁能给点提示？、我的这个例子里缺了什么？以及我应该检查什么地方比请把我需要的确切的过程贴出来更容易得到答复。因为你表现出只要有人能指个正确方向，你就有完成它的能力和决心。 当你提问时慎选提问的论坛小心选择你要提问的场合。如果你做了下述的事情，你很可能被忽略掉或者被看作失败者： 在与主题不合的论坛上贴出你的问题。 在探讨进阶技术问题的论坛张贴非常初级的问题；反之亦然。 在太多的不同新闻群组上重复转贴同样的问题（cross-post）。 向既非熟人也没有义务解决你问题的人发送私人电邮。 黑客会剔除掉那些搞错场合的问题，以保护他们沟通的渠道不被无关的东西淹没。你不会想让这种事发生在自己身上的。 因此，第一步是找到对的论坛。再说一次，Google 和其它搜索引擎还是你的朋友，用它们来找到与你遭遇到困难的软硬件问题最相关的网站。通常那儿都有常见问题（FAQ）、邮件列表及相关说明文件的链接。如果你的努力（包括阅读 FAQ）都没有结果，网站上也许还有报告 Bug（Bug-reporting）的流程或链接，如果是这样，链过去看看。 向陌生的人或论坛发送邮件最可能是风险最大的事情。举例来说，别假设一个提供丰富内容的网页的作者会想充当你的免费顾问。不要对你的问题是否会受到欢迎做太乐观的估计 – 如果你不确定，那就向别处发送，或者压根别发。 在选择论坛、新闻群组或邮件列表时，别太相信名字，先看看 FAQ 或者许可书以弄清楚你的问题是否切题。发文前先翻翻已有的话题，这样可以让你感受一下那里的文化。事实上，事先在新闻组或邮件列表的历史记录中搜索与你问题相关的关键词是个极好的主意，也许这样就找到答案了。即使没有，也能帮助你归纳出更好的问题。 别像机关枪似的一次”扫射”所有的帮助渠道，这就像大喊大叫一样会使人不快。要一个一个地来。 搞清楚你的主题！最典型的错误之一是在某种致力于跨平台可移植的语言、套件或工具的论坛中提关于 Unix 或 Windows 操作系统程序界面的问题。如果你不明白为什么这是大错，最好在搞清楚这之间差异之前什么也别问。 一般来说，在仔细挑选的公共论坛中提问，会比在私有论坛中提同样的问题更容易得到有用的回答。有几个理由可以支持这点，一是看潜在的回复者有多少，二是看观众有多少。黑客较愿意回答那些能帮助到许多人的问题。 可以理解的是，老练的黑客和一些热门软件的作者正在接受过多的错发信息。就像那根最后压垮骆驼背的稻草一样，你的加入也有可能使情况走向极端 —— 已经好几次了，一些热门软件的作者从自己软件的支持中抽身出来，因为伴随而来涌入其私人邮箱的无用邮件变得无法忍受。 Stack Overflow搜索，然后 在 Stack Exchange 问。 近年来，Stack Exchange community 社区已经成为回答技术及其他问题的主要渠道，尤其是那些开放源码的项目。 因为 Google 索引是即时的，在看 Stack Exchange 之前先在 Google 搜索。有很高的机率某人已经问了一个类似的问题，而且 Stack Exchange 网站们往往会是搜索结果中最前面几个。如果你在 Google 上没有找到任何答案，你再到特定相关主题的网站去找。用标签（Tag）搜索能让你更缩小你的搜索结果。 Stack Exchange 已经成长到超过一百个网站，以下是最常用的几个站： Super User 是问一些通用的电脑问题，如果你的问题跟代码或是写程序无关，只是一些网络连线之类的，请到这里。 Stack Overflow 是问写程序有关的问题。 Server Fault 是问服务器和网管相关的问题。 网站和 IRC 论坛本地的使用者群组（user group），或者你所用的 Linux 发行版本也许正在宣传他们的网页论坛或 IRC 频道，并提供新手帮助（在一些非英语国家，新手论坛很可能还是邮件列表）， 这些地方是开始提问的好首选，特别是当你觉得遇到的也许只是相对简单或者很普通的问题时。有广告赞助的 IRC 频道是公开欢迎提问的地方，通常可以即时得到回应。 事实上，如果程序出的问题只发生在特定 Linux 发行版提供的版本（这很常见），最好先去该发行版的论坛或邮件列表中提问，再到程序本身的论坛或邮件列表提问。（否则）该项目的黑客可能仅仅回复 “用我们的版本”。 在任何论坛发文以前，先确认一下有没有搜索功能。如果有，就试着搜索一下问题的几个关键词，也许这会有帮助。如果在此之前你已做过通用的网页搜索（你也该这样做），还是再搜索一下论坛，搜索引擎有可能没来得及索引此论坛的全部内容。 通过论坛或 IRC 频道来提供使用者支持服务有增长的趋势，电子邮件则大多为项目开发者间的交流而保留。所以最好先在论坛或 IRC 中寻求与该项目相关的协助。 在使用 IRC 的时候，首先最好不要发布很长的问题描述，有些人称之为频道洪水。最好通过一句话的问题描述来开始聊天。 第二步，使用项目邮件列表当某个项目提供开发者邮件列表时，要向列表而不是其中的个别成员提问，即使你确信他能最好地回答你的问题。查一查项目的文件和首页，找到项目的邮件列表并使用它。有几个很好的理由支持我们采用这种办法： 任何好到需要向个别开发者提出的问题，也将对整个项目群组有益。反之，如果你认为自己的问题对整个项目群组来说太愚蠢，也不能成为骚扰个别开发者的理由。 向列表提问可以分散开发者的负担，个别开发者（尤其是项目领导人）也许太忙以至于没法回答你的问题。 大多数邮件列表都会被存档，那些被存档的内容将被搜索引擎索引。如果你向列表提问并得到解答，将来其它人可以通过网页搜索找到你的问题和答案，也就不用再次发问了。 如果某些问题经常被问到，开发者可以利用此信息来改进说明文件或软件本身，以使其更清楚。如果只是私下提问，就没有人能看到最常见问题的完整场景。 如果一个项目既有”使用者” 也有”开发者”（或”黑客”）邮件列表或论坛，而你又不会动到那些源代码，那么就向”使用者”列表或论坛提问。不要假设自己会在开发者列表中受到欢迎，那些人多半会将你的提问视为干扰他们开发的噪音。 然而，如果你确信你的问题很特别，而且在”使用者” 列表或论坛中几天都没有回复，可以试试前往”开发者”列表或论坛发问。建议你在张贴前最好先暗地里观察几天以了解那里的行事方式（事实上这是参与任何私有或半私有列表的好主意） 如果你找不到一个项目的邮件列表，而只能查到项目维护者的电子邮件地址，尽管向他发信。即使是在这种情况下，也别假设（项目）邮件列表不存在。在你的电子邮件中，请陈述你已经试过但没有找到合适的邮件列表，也提及你不反对将自己的邮件转发给他人（许多人认为，即使没什么秘密，私人电子邮件也不应该被公开。通过允许将你的电子邮件转发他人，你给了相应人员处置你邮件的选择）。 使用有意义且描述明确的标题在邮件列表、新闻群组或论坛中，大约 50 字以内的标题是抓住资深专家注意力的好机会。别用喋喋不休的帮帮忙、跪求、急（更别说救命啊！！！！这样让人反感的话，用这种标题会被条件反射式地忽略）来浪费这个机会。不要妄想用你的痛苦程度来打动我们，而应该是在这点空间中使用极简单扼要的描述方式来提出问题。 一个好标题范例是目标 —— 差异式的描述，许多技术支持组织就是这样做的。在目标部分指出是哪一个或哪一组东西有问题，在差异部分则描述与期望的行为不一致的地方。 蠢问题：救命啊！我的笔记本电脑不能正常显示了！ 聪明问题：X.org 6.8.1 的鼠标光标会变形，某牌显卡 MV1005 芯片组。 更聪明问题：X.org 6.8.1 的鼠标光标，在某牌显卡 MV1005 芯片组环境下 - 会变形。 编写目标 —— 差异 式描述的过程有助于你组织对问题的细致思考。是什么被影响了？ 仅仅是鼠标光标或者还有其它图形？只在 X.org 的 X 版中出现？或只是出现在 6.8.1 版中？ 是针对某牌显卡芯片组？或者只是其中的 MV1005 型号？ 一个黑客只需瞄一眼就能够立即明白你的环境和你遇到的问题。 总而言之，请想像一下你正在一个只显示标题的存档讨论串（Thread）索引中查寻。让你的标题更好地反映问题，可使下一个搜索类似问题的人能够关注这个讨论串，而不用再次提问相同的问题。 如果你想在回复中提出问题，记得要修改内容标题，以表明你是在问一个问题， 一个看起来像 Re: 测试 或者 Re: 新 bug 的标题很难引起足够重视。另外，在不影响连贯性之下，适当引用并删减前文的内容，能给新来的读者留下线索。 对于讨论串，不要直接点击回复来开始一个全新的讨论串，这将限制你的观众。因为有些邮件阅读程序，比如 mutt ，允许使用者按讨论串排序并通过折叠讨论串来隐藏消息，这样做的人永远看不到你发的消息。 仅仅改变标题还不够。mutt 和其它一些邮件阅读程序还会检查邮件标题以外的其它信息，以便为其指定讨论串。所以宁可发一个全新的邮件。 在网页论坛上，好的提问方式稍有不同，因为讨论串与特定的信息紧密结合，并且通常在讨论串外就看不到里面的内容，故通过回复提问，而非改变标题是可接受的。不是所有论坛都允许在回复中出现分离的标题，而且这样做了基本上没有人会去看。不过，通过回复提问，这本身就是暧昧的做法，因为它们只会被正在查看该标题的人读到。所以，除非你只想在该讨论串当前活跃的人群中提问，不然还是另起炉灶比较好。 使问题容易回复以请将你的回复发送到……来结束你的问题多半会使你得不到回答。如果你觉得花几秒钟在邮件客户端设置一下回复地址都麻烦，我们也觉得花几秒钟思考你的问题更麻烦。如果你的邮件程序不支持这样做，换个好点的；如果是操作系统不支持这种邮件程序，也换个好点的。 在论坛，要求通过电子邮件回复是非常无礼的，除非你认为回复的信息可能比较敏感（有人会为了某些未知的原因，只让你而不是整个论坛知道答案）。如果你只是想在有人回复讨论串时得到电子邮件提醒，可以要求网页论坛发送给你。几乎所有论坛都支持诸如追踪此讨论串、有回复时发送邮件提醒等功能。 用清晰、正确、精准并语法正确的语句我们从经验中发现，粗心的提问者通常也会粗心的写程序与思考（我敢打包票）。回答粗心大意者的问题很不值得，我们宁愿把时间耗在别处。 正确的拼写、标点符号和大小写是很重要的。一般来说，如果你觉得这样做很麻烦，不想在乎这些，那我们也觉得麻烦，不想在乎你的提问。花点额外的精力斟酌一下字句，用不着太僵硬与正式 —— 事实上，黑客文化很看重能准确地使用非正式、俚语和幽默的语句。但它必须很准确，而且有迹象表明你是在思考和关注问题。 正确地拼写、使用标点和大小写，不要将its混淆为it&#39;s，loose搞成lose或者将discrete弄成discreet。不要全部用大写，这会被视为无礼的大声嚷嚷（全部小写也好不到哪去，因为不易阅读。Alan Cox 也许可以这样做，但你不行）。 更白话的说，如果你写得像是个半文盲[译注：小白]，那多半得不到理睬。也不要使用即时通信中的简写或火星文，如将的简化为d会使你看起来像一个为了少打几个键而省字的小白。更糟的是，如果像个小孩似地鬼画符那绝对是在找死，可以肯定没人会理你（或者最多是给你一大堆指责与挖苦）。 如果在使用非母语的论坛提问，你可以犯点拼写和语法上的小错，但决不能在思考上马虎（没错，我们通常能弄清两者的分别）。同时，除非你知道回复者使用的语言，否则请使用英语书写。繁忙的黑客一般会直接删除用他们看不懂语言写的消息。在网络上英语是通用语言，用英语书写可以将你的问题在尚未被阅读就被直接删除的可能性降到最低。 如果英文是你的外语（Second language），提示潜在回复者你有潜在的语言困难是很好的：[译注：以下附上原文以供使用] English is not my native language; please excuse typing errors. 英文不是我的母语，请原谅我的错字或语法。 If you speak $LANGUAGE, please email/PM me;I may need assistance translating my question. 如果你说某语言，请寄信/私讯给我；我需要有人协助我翻译我的问题。 I am familiar with the technical terms,but some slang expressions and idioms are difficult for me. 我对技术名词很熟悉，但对于俗语或是特别用法比较不甚了解。 I’ve posted my question in $LANGUAGE and English.I’ll be glad to translate responses, if you only use one or the other. 我把我的问题用某语言和英文写出来，如果你只用一种语言回答，我会乐意将其翻译成另一种。 使用易于读取且标准的文件格式发送问题如果你人为地将问题搞得难以阅读，它多半会被忽略，人们更愿读易懂的问题，所以： 使用纯文字而不是 HTML (关闭 HTML 并不难）。 使用 MIME 附件通常是可以的，前提是真正有内容（譬如附带的源代码或 patch），而不仅仅是邮件程序生成的模板（譬如只是信件内容的拷贝）。 不要发送一段文字只是一行句子但自动换行后会变成多行的邮件（这使得回复部分内容非常困难）。设想你的读者是在 80 个字符宽的终端机上阅读邮件，最好设置你的换行分割点小于 80 字。 但是，对一些特殊的文件不要设置固定宽度（譬如日志档案拷贝或会话记录）。数据应该原样包含，让回复者有信心他们看到的是和你看到的一样的东西。 在英语论坛中，不要使用Quoted-Printable MIME 编码发送消息。这种编码对于张贴非 ASCII 语言可能是必须的，但很多邮件程序并不支持这种编码。当它们处理换行时，那些文本中四处散布的=20符号既难看也分散注意力，甚至有可能破坏内容的语意。 绝对，永远不要指望黑客们阅读使用封闭格式编写的文档，像微软公司的 Word 或 Excel 文件等。大多数黑客对此的反应就像有人将还在冒热气的猪粪倒在你家门口时你的反应一样。即便他们能够处理，他们也很厌恶这么做。 如果你从使用 Windows 的电脑发送电子邮件，关闭微软愚蠢的智能引号功能 （从[选项] &gt; [校订] &gt; [自动校正选项]，勾选掉智能引号单选框），以免在你的邮件中到处散布垃圾字符。 在论坛，勿滥用表情符号和HTML功能（当它们提供时）。一两个表情符号通常没有问题，但花哨的彩色文本倾向于使人认为你是个无能之辈。过滥地使用表情符号、色彩和字体会使你看来像个傻笑的小姑娘。这通常不是个好主意，除非你只是对性而不是对答案感兴趣。 如果你使用图形用户界面的邮件程序（如微软公司的 Outlook 或者其它类似的），注意它们的默认设置不一定满足这些要求。大多数这类程序有基于选单的查看源代码命令，用它来检查发送文件夹中的邮件，以确保发送的是纯文本文件同时没有一些奇怪的字符。 精确地描述问题并言之有物 仔细、清楚地描述你的问题或 Bug 的症状。 描述问题发生的环境（机器配置、操作系统、应用程序、以及相关的信息），提供经销商的发行版和版本号（如：Fedora Core 4、Slackware 9.1等）。 描述在提问前你是怎样去研究和理解这个问题的。 描述在提问前为确定问题而采取的诊断步骤。 描述最近做过什么可能相关的硬件或软件变更。 尽可能的提供一个可以重现这个问题的可控环境的方法。 尽量去揣测一个黑客会怎样反问你，在你提问之前预先将黑客们可能遇到的问题回答一遍。 以上几点中，当你报告的是你认为可能在代码中的问题时，给黑客一个可以重现你的问题的环境尤其重要。当你这么做时，你得到有效的回答的机会和速度都会大大的提升。 Simon Tatham 写过一篇名为《如何有效的报告 Bug》的出色文章。强力推荐你也读一读。 话不在多而在精你需要提供精确有内容的信息。这并不是要求你简单的把成堆的出错代码或者资料完全转录到你的提问中。如果你有庞大而复杂的测试样例能重现程序挂掉的情境，尽量将它剪裁得越小越好。 这样做的用处至少有三点。第一，表现出你为简化问题付出了努力，这可以使你得到回答的机会增加；第二，简化问题使你更有可能得到有用的答案；第三，在精炼你的 bug 报告的过程中，你很可能就自己找到了解决方法或权宜之计。 别动辄声称找到 Bug当你在使用软件中遇到问题，除非你非常、非常的有根据，不要动辄声称找到了 Bug。提示：除非你能提供解决问题的源代码补丁，或者提供回归测试来表明前一版本中行为不正确，否则你都多半不够完全确信。这同样适用在网页和文件，如果你（声称）发现了文件的Bug，你应该能提供相应位置的修正或替代文件。 请记得，还有许多其它使用者没遇到你发现的问题，否则你在阅读文件或搜索网页时就应该发现了（你在抱怨前已经做了这些，是吧？）。这也意味着很有可能是你弄错了而不是软件本身有问题。 编写软件的人总是非常辛苦地使它尽可能完美。如果你声称找到了 Bug，也就是在质疑他们的能力，即使你是对的，也有可能会冒犯到其中某部分人。当你在标题中嚷嚷着有Bug时，这尤其严重。 提问时，即使你私下非常确信已经发现一个真正的 Bug，最好写得像是你做错了什么。如果真的有 Bug，你会在回复中看到这点。这样做的话，如果真有 Bug，维护者就会向你道歉，这总比你惹恼别人然后欠别人一个道歉要好一点。 低声下气不能代替你的功课有些人明白他们不该粗鲁或傲慢的提问并要求得到答复，但他们选择另一个极端 —— 低声下气：我知道我只是个可悲的新手，一个撸瑟，但...。这既使人困扰，也没有用，尤其是伴随着与实际问题含糊不清的描述时更令人反感。 别用原始灵长类动物的把戏来浪费你我的时间。取而代之的是，尽可能清楚地描述背景条件和你的问题情况。这比低声下气更好地定位了你的位置。 有时网页论坛会设有专为新手提问的版面，如果你真的认为遇到了初学者的问题，到那去就是了，但一样别那么低声下气。 描述问题症状而非你的猜测告诉黑客们你认为问题是怎样造成的并没什么帮助。（如果你的推断如此有效，还用向别人求助吗？），因此要确信你原原本本告诉了他们问题的症状，而不是你的解释和理论；让黑客们来推测和诊断。如果你认为陈述自己的猜测很重要，清楚地说明这只是你的猜测，并描述为什么它们不起作用。 蠢问题 我在编译内核时接连遇到 SIG11 错误，我怀疑某条飞线搭在主板的走线上了，这种情况应该怎样检查最好？ 聪明问题 我的组装电脑是 FIC-PA2007 主机板搭载 AMD K6/233 CPU（威盛 Apollo VP2 芯片组），256MB Corsair PC133 SDRAM 内存，在编译内核时，从开机 20 分钟以后就频频产生 SIG11 错误，但是在头 20 分钟内从没发生过相同的问题。重新启动也没有用，但是关机一晚上就又能工作 20 分钟。所有内存都换过了，没有效果。相关部分的标准编译记录如下…。 由于以上这点似乎让许多人觉得难以配合，这里有句话可以提醒你：所有的诊断专家都来自密苏里州。 美国国务院的官方座右铭则是：让我看看（出自国会议员 Willard D. Vandiver 在 1899 年时的讲话：我来自一个出产玉米，棉花，牛蒡和民主党人的国家，滔滔雄辩既不能说服我，也不会让我满意。我来自密苏里州，你必须让我看看。） 针对诊断者而言，这并不是一种怀疑，而只是一种真实而有用的需求，以便让他们看到的是与你看到的原始证据尽可能一致的东西，而不是你的猜测与归纳的结论。所以，大方的展示给我们看吧！ 按发生时间先后列出问题症状问题发生前的一系列操作，往往就是对找出问题最有帮助的线索。因此，你的说明里应该包含你的操作步骤，以及机器和软件的反应，直到问题发生。在命令行处理的情况下，提供一段操作记录（例如运行脚本工具所生成的），并引用相关的若干行（如 20 行）记录会非常有帮助。 如果挂掉的程序有诊断选项（如 -v 的详述开关），试着选择这些能在记录中增加调试信息的选项。记住，多不等于好。试着选取适当的调试级别以便提供有用的信息而不是让读者淹没在垃圾中。 如果你的说明很长（如超过四个段落），在开头简述问题，接下来再按时间顺序详述会有所帮助。这样黑客们在读你的记录时就知道该注意哪些内容了。 描述目标而不是过程如果你想弄清楚如何做某事（而不是报告一个 Bug），在开头就描述你的目标，然后才陈述重现你所卡住的特定步骤。 经常寻求技术帮助的人在心中有个更高层次的目标，而他们在自以为能达到目标的特定道路上被卡住了，然后跑来问该怎么走，但没有意识到这条路本身就有问题。结果要费很大的劲才能搞定。 蠢问题 我怎样才能从某绘图程序的颜色选择器中取得十六进制的的 RGB 值？ 聪明问题 我正试着用替换一幅图片的色码（color table）成自己选定的色码，我现在知道的唯一方法是编辑每个色码区块（table slot），但却无法从某绘图程序的颜色选择器取得十六进制的的 RGB 值。 第二种提问法比较聪明，你可能得到像是建议采用另一个更合适的工具的回复。 别要求使用私人电邮回复黑客们认为问题的解决过程应该公开、透明，此过程中如果更有经验的人注意到不完整或者不当之处，最初的回复才能够、也应该被纠正。同时，作为提供帮助者可以得到一些奖励，奖励就是他的能力和学识被其他同行看到。 当你要求私下回复时，这个过程和奖励都被中止。别这样做，让回复者来决定是否私下回答 —— 如果他真这么做了，通常是因为他认为问题编写太差或者太肤浅，以至于对其它人没有兴趣。 这条规则存在一条有限的例外，如果你确信提问可能会引来大量雷同的回复时，那么这个神奇的提问句会是向我发电邮，我将为论坛归纳这些回复。试着将邮件列表或新闻群组从洪水般的雷同回复中解救出来是非常有礼貌的 —— 但你必须信守诺言。 清楚明确的表达你的问题以及需求漫无边际的提问是近乎无休无止的时间黑洞。最有可能给你有用答案的人通常也正是最忙的人（他们忙是因为要亲自完成大部分工作）。这样的人对无节制的时间黑洞相当厌恶，所以他们也倾向于厌恶那些漫无边际的提问。 如果你明确表述需要回答者做什么（如提供指点、发送一段代码、检查你的补丁、或是其他等等），就最有可能得到有用的答案。因为这会定出一个时间和精力的上限，便于回答者能集中精力来帮你。这么做很棒。 要理解专家们所处的世界，请把专业技能想像为充裕的资源，而回复的时间则是稀缺的资源。你要求他们奉献的时间越少，你越有可能从真正专业而且很忙的专家那里得到解答。 所以，界定一下你的问题，使专家花在辨识你的问题和回答所需要付出的时间减到最少，这技巧对你有用答案相当有帮助 —— 但这技巧通常和简化问题有所区别。因此，问我想更好的理解 X，可否指点一下哪有好一点说明？通常比问你能解释一下 X 吗？更好。如果你的代码不能运作，通常请别人看看哪里有问题，比要求别人替你改正要明智得多。 询问有关代码的问题时别要求他人帮你调试有问题的代码，不提示一下应该从何入手。张贴几百行的代码，然后说一声：它不能工作会让你完全被忽略。只贴几十行代码，然后说一句：在第七行以后，我期待它显示 &lt;x&gt;，但实际出现的是 &lt;y&gt;比较有可能让你得到回应。 最有效描述程序问题的方法是提供最精简的 Bug 展示测试用例（bug-demonstrating test case）。什么是最精简的测试用例？那是问题的缩影；一小个程序片段能刚好展示出程序的异常行为，而不包含其他令人分散注意力的内容。怎么制作最精简的测试用例？如果你知道哪一行或哪一段代码会造成异常的行为，复制下来并加入足够重现这个状况的代码（例如，足以让这段代码能被编译/直译/被应用程序处理）。如果你无法将问题缩减到一个特定区块，就复制一份代码并移除不影响产生问题行为的部分。总之，测试用例越小越好（查看话不在多而在精一节）。 一般而言，要得到一段相当精简的测试用例并不太容易，但永远先尝试这样做的是种好习惯。这种方式可以帮助你了解如何自行解决这个问题 —— 而且即使你的尝试不成功，黑客们也会看到你在尝试取得答案的过程中付出了努力，这可以让他们更愿意与你合作。 如果你只是想让别人帮忙审查（Review）一下代码，在信的开头就要说出来，并且一定要提到你认为哪一部分特别需要关注以及为什么。 别把自己家庭作业的问题贴上来黑客们很擅长分辨哪些问题是家庭作业式的问题；因为我们中的大多数都曾自己解决这类问题。同样，这些问题得由你来搞定，你会从中学到东西。你可以要求给点提示，但别要求得到完整的解决方案。 如果你怀疑自己碰到了一个家庭作业式的问题，但仍然无法解决，试试在使用者群组，论坛或（最后一招）在项目的使用者邮件列表或论坛中提问。尽管黑客们会看出来，但一些有经验的使用者也许仍会给你一些提示。 去掉无意义的提问句避免用无意义的话结束提问，例如有人能帮我吗？或者这有答案吗？。 首先：如果你对问题的描述不是很好，这样问更是画蛇添足。 其次：由于这样问是画蛇添足，黑客们会很厌烦你 —— 而且通常会用逻辑上正确，但毫无意义的回答来表示他们的蔑视， 例如：没错，有人能帮你或者不，没答案。 一般来说，避免用 是或否、对或错、有或没有类型的问句，除非你想得到是或否类型的回答。 即使你很急也不要在标题写紧急这是你的问题，不是我们的。宣称紧急极有可能事与愿违：大多数黑客会直接删除无礼和自私地企图即时引起关注的问题。更严重的是，紧急这个字（或是其他企图引起关注的标题）通常会被垃圾信过滤器过滤掉 —— 你希望能看到你问题的人可能永远也看不到。 有半个例外的情况是，如果你是在一些很高调，会使黑客们兴奋的地方，也许值得这样去做。在这种情况下，如果你有时间压力，也很有礼貌地提到这点，人们也许会有兴趣回答快一点。 当然，这风险很大，因为黑客们兴奋的点多半与你的不同。譬如从 NASA 国际空间站（International Space Station）发这样的标题没有问题，但用自我感觉良好的慈善行为或政治原因发肯定不行。事实上，张贴诸如紧急：帮我救救这个毛绒绒的小海豹！肯定让你被黑客忽略或惹恼他们，即使他们认为毛绒绒的小海豹很重要。 如果你觉得这点很不可思议，最好再把这份指南剩下的内容多读几遍，直到你弄懂了再发文。 礼多人不怪，而且有时还很有帮助彬彬有礼，多用请和谢谢您的关注，或谢谢你的关照。让大家都知道你对他们花时间免费提供帮助心存感激。 坦白说，这一点并没有比清晰、正确、精准并合法语法和避免使用专用格式重要（也不能取而代之）。黑客们一般宁可读有点唐突但技术上鲜明的 Bug 报告，而不是那种有礼但含糊的报告。（如果这点让你不解，记住我们是按问题能教给我们什么来评价问题的价值的） 然而，如果你有一串的问题待解决，客气一点肯定会增加你得到有用回应的机会。 （我们注意到，自从本指南发布后，从资深黑客那里得到的唯一严重缺陷反馈，就是对预先道谢这一条。一些黑客觉得先谢了意味着事后就不用再感谢任何人的暗示。我们的建议是要么先说先谢了，然后事后再对回复者表示感谢，或者换种方式表达感激，譬如用谢谢你的关注或谢谢你的关照。） 问题解决后，加个简短的补充说明问题解决后，向所有帮助过你的人发个说明，让他们知道问题是怎样解决的，并再一次向他们表示感谢。如果问题在新闻组或者邮件列表中引起了广泛关注，应该在那里贴一个说明比较恰当。 最理想的方式是向最初提问的话题回复此消息，并在标题中包含已修正，已解决或其它同等含义的明显标记。在人来人往的邮件列表里，一个看见讨论串问题 X和问题 X - 已解决的潜在回复者就明白不用再浪费时间了（除非他个人觉得问题 X的有趣），因此可以利用此时间去解决其它问题。 补充说明不必很长或是很深入；简单的一句你好，原来是网线出了问题！谢谢大家 – Bill比什么也不说要来的好。事实上，除非结论真的很有技术含量，否则简短可爱的小结比长篇大论更好。说明问题是怎样解决的，但大可不必将解决问题的过程复述一遍。 对于有深度的问题，张贴调试记录的摘要是有帮助的。描述问题的最终状态，说明是什么解决了问题，在此之后才指明可以避免的盲点。避免盲点的部分应放在正确的解决方案和其它总结材料之后，而不要将此信息搞成侦探推理小说。列出那些帮助过你的名字，会让你交到更多朋友。 除了有礼貌和有内涵以外，这种类型的补充也有助于他人在邮件列表/新闻群组/论坛中搜索到真正解决你问题的方案，让他们也从中受益。 至少，这种补充有助于让每位参与协助的人因问题的解决而从中得到满足感。如果你自己不是技术专家或者黑客，那就相信我们，这种感觉对于那些你向他们求助的大师或者专家而言，是非常重要的。问题悬而未决会让人灰心；黑客们渴望看到问题被解决。好人有好报，满足他们的渴望，你会在下次提问时尝到甜头。 思考一下怎样才能避免他人将来也遇到类似的问题，自问写一份文件或加个常见问题（FAQ）会不会有帮助。如果是的话就将它们发给维护者。 在黑客中，这种良好的后继行动实际上比传统的礼节更为重要，也是你如何透过善待他人而赢得声誉的方式，这是非常有价值的资产。 如何解读答案 RTFM 和 STFW：如何知道你已完全搞砸了有一个古老而神圣的传统：如果你收到RTFM （Read The Fucking Manual）的回应，回答者认为你应该去读他妈的手册。当然，基本上他是对的，你应该去读一读。 RTFM 有一个年轻的亲戚。如果你收到STFW（Search The Fucking Web）的回应，回答者认为你应该到他妈的网上搜索。那人多半也是对的，去搜索一下吧。（更温和一点的说法是 Google 是你的朋友！） 在论坛，你也可能被要求去爬爬论坛的旧文。事实上，有人甚至可能热心地为你提供以前解决此问题的讨论串。但不要依赖这种关照，提问前应该先搜索一下旧文。 通常，用这两句之一回答你的人会给你一份包含你需要内容的手册或者一个网址，而且他们打这些字的时候也正在读着。这些答复意味着回答者认为 你需要的信息非常容易获得； 你自己去搜索这些信息比灌给你，能让你学到更多。 你不应该因此不爽；依照黑客的标准，他已经表示了对你一定程度的关注，而没有对你的要求视而不见。你应该对他祖母般的慈祥表示感谢。 如果还是搞不懂如果你看不懂回应，别立刻要求对方解释。像你以前试着自己解决问题时那样（利用手册，FAQ，网络，身边的高手），先试着去搞懂他的回应。如果你真的需要对方解释，记得表现出你已经从中学到了点什么。 比方说，如果我回答你：看来似乎是 zentry 卡住了；你应该先清除它。，然后，这是一个很糟的后续问题回应：zentry 是什么？ 好的问法应该是这样：哦~~~我看过说明了但是只有 -z 和 -p 两个参数中提到了 zentries，而且还都没有清楚的解释如何清除它。你是指这两个中的哪一个吗？还是我看漏了什么？ 处理无礼的回应很多黑客圈子中看似无礼的行为并不是存心冒犯。相反，它是直接了当，一针见血式的交流风格，这种风格更注重解决问题，而不是使人感觉舒服而却模模糊糊。 如果你觉得被冒犯了，试着平静地反应。如果有人真的做了出格的事，邮件列表、新闻群组或论坛中的前辈多半会招呼他。如果这没有发生而你却发火了，那么你发火对象的言语可能在黑客社区中看起来是正常的，而你将被视为有错的一方，这将伤害到你获取信息或帮助的机会。 另一方面，你偶尔真的会碰到无礼和无聊的言行。与上述相反，对真正的冒犯者狠狠地打击，用犀利的语言将其驳得体无完肤都是可以接受的。然而，在行事之前一定要非常非常的有根据。纠正无礼的言论与开始一场毫无意义的口水战仅一线之隔，黑客们自己莽撞地越线的情况并不鲜见。如果你是新手或外人，避开这种莽撞的机会并不高。如果你想得到的是信息而不是消磨时光，这时最好不要把手放在键盘上以免冒险。 （有些人断言很多黑客都有轻度的自闭症或亚斯伯格综合症，缺少用于润滑人类社会正常交往所需的神经。这既可能是真也可能是假的。如果你自己不是黑客，兴许你认为我们脑袋有问题还能帮助你应付我们的古怪行为。只管这么干好了，我们不在乎。我们喜欢我们现在这个样子，并且通常对病患标记都有站得住脚的怀疑）。 Jeff Bigler 的观察总结和这个相关也值得一读 (tact filters)。 在下一节，我们会谈到另一个问题，当你行为不当时所会受到的冒犯。 如何避免扮演失败者在黑客社区的论坛中有那么几次你可能会搞砸 —— 以本指南所描述到的或类似的方式。而你会在公开场合中被告知你是如何搞砸的，也许攻击的言语中还会带点夹七夹八的颜色。 这种事发生以后，你能做的最糟糕的事莫过于哀嚎你的遭遇、宣称被口头攻击、要求道歉、高声尖叫、憋闷气、威胁诉诸法律、向其雇主报怨、忘了关马桶盖等等。相反地，你该这么做： 熬过去，这很正常。事实上，它是有益健康且合理的。 社区的标准不会自行维持，它们是通过参与者积极而公开地执行来维持的。不要哭嚎所有的批评都应该通过私下的邮件传送，它不是这样运作的。当有人评论你的一个说法有误或者提出不同看法时，坚持声称受到个人攻击也毫无益处，这些都是失败者的态度。 也有其它的黑客论坛，受过高礼节要求的误导，禁止参与者张贴任何对别人帖子挑毛病的消息，并声称如果你不想帮助用户就闭嘴。 结果造成有想法的参与者纷纷离开，这么做只会使它们沦为毫无意义的唠叨与无用的技术论坛。 夸张的讲法是：你要的是“友善”（以上述方式）还是有用？两个里面挑一个。 记着：当黑客说你搞砸了，并且（无论多么刺耳）告诉你别再这样做时，他正在为关心你和他的社区而行动。对他而言，不理你并将你从他的生活中滤掉更简单。如果你无法做到感谢，至少要表现得有点尊严，别大声哀嚎，也别因为自己是个有戏剧性超级敏感的灵魂和自以为有资格的新来者，就指望别人像对待脆弱的洋娃娃那样对你。 有时候，即使你没有搞砸（或者只是在他的想像中你搞砸了），有些人也会无缘无故地攻击你本人。在这种情况下，抱怨倒是真的会把问题搞砸。 这些来找麻烦的人要么是毫无办法但自以为是专家的不中用家伙，要么就是测试你是否真会搞砸的心理专家。其它读者要么不理睬，要么用自己的方式对付他们。这些来找麻烦的人在给他们自己找麻烦，这点你不用操心。 也别让自己卷入口水战，最好不要理睬大多数的口水战 – 当然，这是在你检验它们只是口水战，并且未指出你有搞砸的地方，同时也没有巧妙地将问题真正的答案藏于其后（这也是有可能的）。 不该问的问题以下是几个经典蠢问题，以及黑客没回答时心中所想的： 问题：我能在哪找到 X 程序或 X 资源？ 问题：我怎样用 X 做 Y？ 问题：如何设定我的 shell 提示？ 问题：我可以用 Bass-o-matic 文件转换工具将 AcmeCorp 档案转换为 TeX 格式吗？ 问题：我的程序/设定/SQL 语句没有用 问题：我的 Windows 电脑有问题，你能帮我吗？ 问题：我的程序不会动了，我认为系统工具 X 有问题 问题：我在安装 Linux（或者 X ）时有问题，你能帮我吗？ 问题：我怎么才能破解 root 帐号/窃取 OP 特权/读别人的邮件呢？ 问题：我能在哪找到 X 程序或 X 资源？ 回答：就在我找到它的地方啊，白痴 —— 搜索引擎的那一头。天哪！难道还有人不会用 Google 吗？ 问题：我怎样用 X 做 Y？ 回答：如果你想解决的是 Y ，提问时别给出可能并不恰当的方法。这种问题说明提问者不但对 X 完全无知，也对 Y 要解决的问题糊涂，还被特定形势禁锢了思维。最好忽略这种人，等他们把问题搞清楚了再说。 问题：如何设定我的 shell 提示？？ 回答：如果你有足够的智慧提这个问题，你也该有足够的智慧去 RTFM，然后自己去找出来。 问题：我可以用 Bass-o-matic 文件转换工具将 AcmeCorp 档案转换为 TeX 格式吗？ 回答：试试看就知道了。如果你试过，你既知道了答案，就不用浪费我的时间了。 问题：我的{程序/设定/SQL 语句}不工作 回答：这不算是问题吧，我对要我问你二十个问题才找得出你真正问题的问题没兴趣 —— 我有更有意思的事要做呢。在看到这类问题的时候，我的反应通常不外如下三种 你还有什么要补充的吗？ 真糟糕，希望你能搞定。 这关我有什么屁事？ 问题：我的 Windows 电脑有问题，你能帮我吗？ 回答：能啊，扔掉微软的垃圾，换个像 Linux 或 BSD 的开源操作系统吧。 注意：如果程序有官方版 Windows 或者与 Windows 有互动（如 Samba），你可以问与 Windows 相关的问题， 只是别对问题是由 Windows 操作系统而不是程序本身造成的回复感到惊讶， 因为 Windows 一般来说实在太烂，这种说法通常都是对的。 问题：我的程序不会动了，我认为系统工具 X 有问题 回答：你完全有可能是第一个注意到被成千上万用户反复使用的系统调用与函数库档案有明显缺陷的人，更有可能的是你完全没有根据。不同凡响的说法需要不同凡响的证据，当你这样声称时，你必须有清楚而详尽的缺陷说明文件作后盾。 问题：我在安装 Linux（或者 X ）时有问题，你能帮我吗？ 回答：不能，我只有亲自在你的电脑上动手才能找到毛病。还是去找你当地的 Linux 使用群组者寻求实际的指导吧（你能在这儿找到使用者群组的清单）。 注意：如果安装问题与某 Linux 的发行版有关，在它的邮件列表、论坛或本地使用者群组中提问也许是恰当的。此时，应描述问题的准确细节。在此之前，先用 Linux 和所有被怀疑的硬件作关键词仔细搜索。 问题：我怎么才能破解 root 帐号/窃取 OP 特权/读别人的邮件呢？ 回答：想要这样做，说明了你是个卑鄙小人；想找个黑客帮你，说明你是个白痴！ 好问题与蠢问题最后，我将透过举一些例子，来说明怎样聪明的提问；同一个问题的两种问法被放在一起，一种是愚蠢的，另一种才是明智的。 蠢问题： 我可以在哪儿找到关于 Foonly Flurbamatic 的资料？ 这种问法无非想得到 STFW 这样的回答。 聪明问题： 我用 Google 搜索过 “Foonly Flurbamatic 2600”，但是没找到有用的结果。谁知道上哪儿去找对这种设备编程的资料？ 这个问题已经 STFW 过了，看起来他真的遇到了麻烦。 蠢问题： 我从 foo 项目找来的源码没法编译。它怎么这么烂？ 他觉得都是别人的错，这个傲慢自大的提问者。 聪明问题： foo 项目代码在 Nulix 6.2 版下无法编译通过。我读过了 FAQ，但里面没有提到跟 Nulix 有关的问题。这是我编译过程的记录，我有什么做的不对的地方吗？ 提问者已经指明了环境，也读过了 FAQ，还列出了错误，并且他没有把问题的责任推到别人头上，他的问题值得被关注。 蠢问题： 我的主机板有问题了，谁来帮我？ 某黑客对这类问题的回答通常是：好的，还要帮你拍拍背和换尿布吗？，然后按下删除键。 聪明问题： 我在 S2464 主机板上试过了 X 、 Y 和 Z ，但没什么作用，我又试了 A 、 B 和 C 。请注意当我尝试 C 时的奇怪现象。显然 florbish 正在 grommicking，但结果出人意料。通常在 Athlon MP 主机板上引起 grommicking 的原因是什么？有谁知道接下来我该做些什么测试才能找出问题？ 这个家伙，从另一个角度来看，值得去回答他。他表现出了解决问题的能力，而不是坐等天上掉答案。 在最后一个问题中，注意告诉我答案和给我启示，指出我还应该做什么诊断工作之间微妙而又重要的区别。 事实上，后一个问题源自于 2001 年 8 月在 Linux 内核邮件列表（lkml）上的一个真实的提问。我（Eric）就是那个提出问题的人。我在 Tyan S2464 主板上观察到了这种无法解释的锁定现象，列表成员们提供了解决这一问题的重要信息。 通过我的提问方法，我给了别人可以咀嚼玩味的东西；我设法让人们很容易参与并且被吸引进来。我显示了自己具备和他们同等的能力，并邀请他们与我共同探讨。通过告诉他们我所走过的弯路，以避免他们再浪费时间，我也表明了对他们宝贵时间的尊重。 事后，当我向每个人表示感谢，并且赞赏这次良好的讨论经历的时候， 一个 Linux 内核邮件列表的成员表示，他觉得我的问题得到解决并非由于我是这个列表中的名人，而是因为我用了正确的方式来提问。 黑客从某种角度来说是拥有丰富知识但缺乏人情味的家伙；我相信他是对的，如果我像个乞讨者那样提问，不论我是谁，一定会惹恼某些人或者被他们忽视。他建议我记下这件事，这直接导致了本指南的出现。 如果得不到回答如果仍得不到回答，请不要以为我们觉得无法帮助你。有时只是看到你问题的人不知道答案罢了。没有回应不代表你被忽视，虽然不可否认这种差别很难区分。 总的来说，简单的重复张贴问题是个很糟的点子。这将被视为无意义的喧闹。有点耐心，知道你问题答案的人可能生活在不同的时区，可能正在睡觉，也有可能你的问题一开始就没有组织好。 你可以通过其他渠道获得帮助，这些渠道通常更适合初学者的需要。 有许多网上的以及本地的使用者群组，由热情的软件爱好者（即使他们可能从没亲自写过任何软件）组成。通常人们组建这样的团体来互相帮助并帮助新手。 另外，你可以向很多商业公司寻求帮助，不论公司大还是小。别为要付费才能获得帮助而感到沮丧！毕竟，假使你的汽车发动机汽缸密封圈爆掉了 —— 完全可能如此 —— 你还得把它送到修车铺，并且为维修付费。就算软件没花费你一分钱，你也不能强求技术支持总是免费的。 对像是 Linux 这种大众化的软件，每个开发者至少会对应到上万名使用者。根本不可能由一个人来处理来自上万名使用者的求助电话。要知道，即使你要为这些协助付费，和你所购买的同类软件相比，你所付出的也是微不足道的（通常封闭源代码软件的技术支持费用比开源软件的要高得多，且内容也没那么丰富）。 如何更好地回答问题态度和善一点。问题带来的压力常使人显得无礼或愚蠢，其实并不是这样。 对初犯者私下回复。对那些坦诚犯错之人没有必要当众羞辱，一个真正的新手也许连怎么搜索或在哪找常见问题都不知道。 如果你不确定，一定要说出来！一个听起来权威的错误回复比没有还要糟，别因为听起来像个专家很好玩，就给别人乱指路。要谦虚和诚实，给提问者与同行都树个好榜样。 如果帮不了忙，也别妨碍他。不要在实际步骤上开玩笑，那样也许会毁了使用者的设置 —— 有些可怜的呆瓜会把它当成真的指令。 试探性的反问以引出更多的细节。如果你做得好，提问者可以学到点东西 —— 你也可以。试试将蠢问题转变成好问题，别忘了我们都曾是新手。 尽管对那些懒虫抱怨一声 RTFM 是正当的，能指出文件的位置（即使只是建议个 Google 搜索关键词）会更好。 如果你决定回答，就请给出好的答案。当别人正在用错误的工具或方法时别建议笨拙的权宜之计（wordaround），应推荐更好的工具，重新界定问题。 正面的回答问题！如果这个提问者已经很深入的研究而且也表明已经试过 X 、 Y 、 Z 、 A 、 B 、 C 但没得到结果，回答 试试看 A 或是 B 或者 试试 X 、 Y 、 Z 、 A 、 B 、 C 并附上一个链接一点用都没有。 帮助你的社区从问题中学习。当回复一个好问题时，问问自己如何修改相关文件或常见问题文件以免再次解答同样的问题？，接着再向文件维护者发一份补丁。 如果你是在研究一番后才做出的回答，展现你的技巧而不是直接端出结果。毕竟授人以鱼不如授人以渔。","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"意志力","slug":"pageyizhili","date":"2020-04-12T02:18:39.000Z","updated":"2020-04-12T02:49:18.055Z","comments":true,"path":"2020/04/12/pageyizhili/","link":"","permalink":"http://yoursite.com/2020/04/12/pageyizhili/","excerpt":"","text":"正确认识意志力1）意志力并非恒定。人的意志力是有限的，使用就会消耗，情绪波动，注意力难以集中都是意志力下降的表现；2）意志力消耗的主要方式。控制思维，比如让自己忽略或摆脱某个想法；控制情绪，比如控制愤怒，悲伤等；控制冲动，抵制某种诱惑，比如美食，烟瘾等；控制表现，把能量集中于当前任务目标。3）意志力与葡萄糖。人体内葡萄糖含量与意志力水平呈正相关关系；不要在饿肚子的情况下做重要的事情；选择血糖指数低的食物来维持特定的血糖水平，如蔬菜，鱼类、坚果等，而不是来得快去的也快的米饭、面条； 把意志力用在关键事情上1）完成任务或制定目标。最好某个阶段只专注于一个清晰的目标，关注长期目标会让完成效果更好，目标太多容易冲突，制定的目标应该相互支持而不是相互冲突，制定月计划，在变通中执行，而不是严苛的日计划；2）决策疲劳。做出与自己相关的决策非常耗费意志力；尽量消灭选择，不要苛求完美。 意志力可以锻炼和培养的1）提升成年人的意志力。习惯的养成能大幅提升意志力水平，如早起、坐直等；不要设置过高的障碍，不断体会进步才能提升意志力水平；不要滥用意志力，这样关键时刻你才能撑的更久。2）培养意志力强大的孩子。先有足够的自尊，孩子才懂得自制，制定明确的规则，但要给孩子机会参与决策，父母先做好情绪管理，保持头脑冷静。 意志力与减肥1）节食是最糟糕的减肥方法：为了不吃，节食者需要消耗大量的意志力；失误剥夺状态会让节食者陷入“去他的效应”2）减肥人群可以这样做。实施意向，与其说“绝不吃什么”，不如说我要吃“蔬菜和鱼来替代”，巧用延迟满足来降低身体对某种食物的渴望；每周最多只称一次体重，保持减肥的动力。 以上来自来自樊登读书。","categories":[],"tags":[]},{"title":"影评-驴得水","slug":"pagelvdeshui","date":"2020-04-11T16:01:03.000Z","updated":"2020-04-11T16:10:14.190Z","comments":true,"path":"2020/04/12/pagelvdeshui/","link":"","permalink":"http://yoursite.com/2020/04/12/pagelvdeshui/","excerpt":"","text":"作为一部荒诞喜剧片，虽然片中有一些地方用力过猛，也有一些话剧的痕迹，但整体效果还是非常精彩的，用喜剧的方式谈悲剧，用讽刺的手法讲人性。 1）片中的女人。一曼，所有都是表象，放荡只是用一种夸张的方式表现一曼对于性的渴求，对男人的渴求，其实本质上是对爱情的渴求。一曼是一个很真实的女人，一个渴望爱情甚至忠贞不渝的女人；孙佳，影片中的个小角色，看遍了一切假恶丑之后终于是出走了。渴望爱情，对世界充满美好期待，结果却看尽一个个男人的假恶丑，最后的结局是绝望；铜匠老婆，横竖都不怕，耍泼骂街，一巴掌打掉了教育专员随从手中的纸老虎式的手枪，她至少比电影当中的大部分人物要真实可爱得多。 2）片中的男人。魁山、铁男、铜匠听上去一个比一个威猛，其实都是软蛋。魁山是个一到关键时刻就“软”的男人，片中多次出现其一遇事就拉肚子，掉链子的情景，一曼在多次调侃其性能力，这不是对于性能力的评价，而是用性能力来隐喻他的人品–怂；铁男，在变身奴才之前所变现出来的暴戾和猖狂，对铜匠的拳打脚踢，言语咒骂。被枪吓破胆变身软蛋之后蹲在墙角吃黄瓜，面对军人欲强奸一曼而缩在一边的表现，天生软蛋；铜匠，也是一个软蛋，一个从心理和生理都被老婆压在身下的男人，一个奴性十足的人，当奴才变成了主人，会比原来的主人更变本加厉；当主子变成的奴才，会比原来的奴才更奴性十足得势时的蛮横和失势时的软弱可见一斑，铜匠的转变也可见他的淳朴也只是表面，变本加厉的羞辱更为他的奴性本质添砖加瓦；校长，整个电影下来看似最为正常的一个男人，唯一一个至始至终没有转变始终如一的男人，但其实是很卑鄙、很懦弱的角色，丧失了所有脾性、被阉割了的男人的角色。校长是自始至终的“办大事者不拘小节”的价值观是彻底的无节操无下限的功利主义主义者，为了目的不折手段，把女人当做工具，遇到困难就想让女人出面顶下来，开始是一曼，后来连女儿都可以牺牲。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-真爱至上","slug":"pagezhenaizhishang","date":"2020-04-11T07:22:04.000Z","updated":"2020-04-11T07:44:35.218Z","comments":true,"path":"2020/04/11/pagezhenaizhishang/","link":"","permalink":"http://yoursite.com/2020/04/11/pagezhenaizhishang/","excerpt":"","text":"一个由10个故事组成的电影，虽然故事比较多，但整体剧情节奏还是非常流畅的。 1.“灰姑娘与首相”：一位新晋的英国首相，年轻有为的他刚刚进入英国首相官邸的第一天，就发现自己爱上了漂亮的娜塔丽，而娜塔丽的工作就是每天负责为首相端茶倒水，首相碍于自己的身份不好表白，但是真情又难违。美国总统来访，一直不敢违背美国意志的首相看到美国总统调戏娜塔莉后冲冠一怒为红颜，在记者招待会上态度强硬，反而成了英国人的爱国偶像。但他随后调走了娜塔莉， 在充满奇迹的圣诞夜，首相收到了娜塔莉的明信片，于是带领手下挨家挨户的寻找她，两人最终拥吻在娜塔莉母校的舞台上； 2。“诱惑出轨回归”：首相的姐姐婚姻生活幸福，丈夫是一家公司老板，受到了女下属的诱惑。圣诞夜妻子发现丈夫买的金项链，欣喜若狂，但拆开他送自己的礼物却是一盒CD，于是明白了丈夫的外遇，非常伤心，首相的姐姐在子女演出后与丈夫摊牌，最终赢得了丈夫的抱歉和回心转意； 3.“擦肩而过的爱”：首相姐姐的丈夫手下另一位女职员暗恋另一个男同事，在大家的鼓励下圣诞夜与男友回家，却在最温馨的时刻总被自己的精神病弟弟打断，两人沮丧不已， 女职员因为弟弟的原因，最终放弃了对爱情的追求…… 4.“邂逅的爱情”：首相姐姐的好友，另位中年丧偶的男子，是首相姐姐的好友。妻子死后非常伤心，又存在着与继子的关系问题。父亲在学校里也邂逅了一位单亲母亲，两人擦出火花； 5.“情窦初开”：小男孩暗恋学校最美丽的女生。在继父的鼓励下，男孩决定用最快的速度学习打击乐，在圣诞晚会上为心上人伴奏。小男孩的打击乐很成功，但女孩就要去美国了，父亲带着他狂奔去机场，男孩冲破警察封锁，在女孩登机前向她表白，赢得了女孩的芳心； 6.“疗伤之爱”：一位作家很爱自己的妻子，没想到缺受到妻子的背叛，跑到法国乡村疗伤，却与女管家发生了感情。女管家只懂葡萄牙语，作家讲英语，两个语言无法交流的人却奇迹般的存在着心灵上的沟通。作家从法国回来后苦读葡萄牙语，而女孩却在学英语，在圣诞节跑到了葡萄牙，向女管家求婚，一个用葡萄牙求婚，一个用英语接受求爱； 7.“蓦然回首，爱在身边”：一个过气的摇滚歌星千方百计想重返舞台找回曾经的荣耀与喝彩，说话粗鲁不经大脑，行为出人意料，常常令他的经纪人无比头疼。 摇滚乐手终于咸鱼翻身，但他突然意识到，一直倍受他嘲笑、总是为他收拾麻烦的胖经纪人，其实是他一生中最为亲密的伙伴和爱人，他到了老朋友的家与他共庆圣诞节； 8.“爱上不该爱的人”：，一个腼腆的青年喜欢朋友的女朋友，他不敢表白，只能冷淡对待，让朋友以为他不喜欢自己的妻子。在他们婚礼后一个偶然的机会新娘发现了他拍摄的婚礼录像，上面只有自己的身影，圣诞节举着牌子向朋友的妻子表白，要把她永远放在心里，然后静静离开，没有打扰朋友的生活； 9.“美国寻爱”：一个感情上屡受挫折的厨师，卖掉家产去美国寻找艳遇，结果在酒吧遇到了四位辣妹； 10.“假戏生情”，一对拍A片的男女演员，在假戏里产生了真情，A片的男女演员在圣诞节表白，成了恋人。","categories":[],"tags":[{"name":"ganwu","slug":"ganwu","permalink":"http://yoursite.com/tags/ganwu/"}]},{"title":"影评-爆裂鼓手","slug":"pagebaoliegushou","date":"2020-04-11T03:21:55.000Z","updated":"2020-04-11T03:30:42.366Z","comments":true,"path":"2020/04/11/pagebaoliegushou/","link":"","permalink":"http://yoursite.com/2020/04/11/pagebaoliegushou/","excerpt":"","text":"电影中对艺术的投入已经超出了不疯魔不成活的境界，摧残身体，放弃感情，要突破人体极限必须如此么？但在艺术的道路上，的确是勇于自我牺牲的少数人进入终极的殿堂。师徒二人是同一类人，他们都是苦行僧，都是精神偏执的野心家，都是艺术疯子。世界未必善待努力的人，努力了也未必成功，但不努力，肯定不成功！ 整个电影节奏和音乐完美融合，一句话形容“就是这个电影很爵士”。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-我是山姆","slug":"pagewoshishanmu","date":"2020-04-09T12:15:45.000Z","updated":"2020-04-09T12:28:54.232Z","comments":true,"path":"2020/04/09/pagewoshishanmu/","link":"","permalink":"http://yoursite.com/2020/04/09/pagewoshishanmu/","excerpt":"","text":"好父母要始终如一、需要陪伴孩子、需要耐心、需要聆听、即使听不进也要假装听，孩子需要的只是爱。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-看不见的客人","slug":"pagekanbujian","date":"2020-04-08T12:25:55.000Z","updated":"2020-04-09T01:17:41.543Z","comments":true,"path":"2020/04/08/pagekanbujian/","link":"","permalink":"http://yoursite.com/2020/04/08/pagekanbujian/","excerpt":"","text":"反转太多次了，值得一看的好片。 我觉得豆瓣上的一篇文章分析的特别好，如下： https://www.douban.com/doubanapp/dispatch/review/8819000。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-调音师","slug":"tiaoyinshi","date":"2020-04-07T11:42:13.000Z","updated":"2020-04-11T13:03:45.664Z","comments":true,"path":"2020/04/07/tiaoyinshi/","link":"","permalink":"http://yoursite.com/2020/04/07/tiaoyinshi/","excerpt":"","text":"剧情简直太烧脑，开始以为是励志片，又成了爱情片，再然后又是犯罪片，然后才是悬疑片，情节多变、多次反转，影片开始的兔子和结束时的兔子首尾呼应，引用网友的评论“最后一击神反转！攻击加成%50”。 推荐一篇文章http://www.hxnews.com/news/yl/dyzx/201904/12/1736874.shtml","categories":[],"tags":[]},{"title":"减肚子","slug":"pagejianduzi","date":"2020-04-07T08:01:10.000Z","updated":"2020-04-07T13:07:07.775Z","comments":true,"path":"2020/04/07/pagejianduzi/","link":"","permalink":"http://yoursite.com/2020/04/07/pagejianduzi/","excerpt":"","text":"发现三天不练，肚子上肉就上来了，目前正在实施以下减肚子方法，贵在坚持不懈！ 1 体育锻炼手段仰卧起坐要收紧肚子，腿部绷紧不要动，尽量双手抱头，勾起身体尽量保持3秒，重复动作20遍。 剪刀脚躺在瑜伽垫上，双手放于身体两侧，两条腿伸直抬高做左右交替运动。大约重复动作20-30次左右。 上下抬腿平躺，双手放在身体两侧，双腿并拢抬起，膝盖打直尽量使双腿与地面呈直角，停留10秒到20秒左右。吐气将双腿缓缓放下但不触地 2 日常生活注意多走路、多喝水、多按摩走路及喝水有利腹部扁平。同时可以每天在腹部做环行按摩，坚持按照方法三进行一周。 上课或上班路上多走路骑车走路时，可以练习“腹式呼吸法”：吸气时，肚皮胀起;呼气时，肚皮缩紧。此呼吸法有助于刺激肠胃蠕动，促进体内废气物的排出体外，使气流顺畅，以提高肺活量。平常走路和站立的时候，用力地缩小腹，结合腹式呼吸，使小腹肌肉变得紧实更实。 上课或上班时刻收腹上课坐着或上班坐着时，把塑腰带绑在腰上时刻收缩肚子。随时做做收腹运动，在走路的时候，也要吸气收腹，坐在办公室工作也要经常提醒自己，昂首挺胸，在这个吸气收腹过程中，肌肉的紧绷会有利于消耗更多热量。 饭后站立吃完饭后不要马上坐沙发，要站立半小时。看电视的时候，多扭扭腰，还可以多喝酸奶，很多减肥专家和营养师都认为，腹部肥胖问题都与肠道健康有很大关系，酸奶中含有最富价值的乳酸菌，可以增加肠道的酸性，抑制腐败菌生长，每天至少喝一杯酸奶，或者吃含50毫克以上的益生菌的营养片，都是对减肚子上的赘肉有益处的 食用健康绿色的食品酸奶与发酵的牛奶能激活消化必须的物质，有助于改善肠道微生物系统，从而防止腹部隆起。 吃饭养成好习惯吃饭时慢慢吃，先喝汤，再吃菜，最后再吃肉类，咀嚼要够充分。 少吃高淀粉食物不要吃例如面包和薯条等这些含淀粉量高且油腻的食物，它们可是腹部脂肪堆累的“建筑基础”。淀粉是高热量的载体，其本身并不会使人发胖，但如果摄入淀粉过量，热量就多的消耗不完，多余热量就会转化为脂肪储存起来。 注重蛋白质摄入较好的蛋白质来源有：鱼虾肉、鸡鸭肉，它们的脂肪含量较低且富含营养，高蛋白质，有助于体内肌肉的增长，促进腹部脂肪燃烧。平常吃肉可以尽量选择这些品类。 多吃豆类豆类含丰含蛋白质和纤维，能够吸收人体里多余的脂肪。 3 任何的方法坚持都有效果减肥之所以难是因为要重塑人的饮食生活习惯，否则即使减下去也会出现反弹的情况，只是或多或少。正确的认识减肥，才能做到正确的减肥。","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"峰值体验","slug":"pagefengzhitiyan","date":"2020-04-07T07:27:57.000Z","updated":"2020-04-12T03:16:23.528Z","comments":true,"path":"2020/04/07/pagefengzhitiyan/","link":"","permalink":"http://yoursite.com/2020/04/07/pagefengzhitiyan/","excerpt":"","text":"峰终定律：高峰和结尾时的体验决定我们对整件事的评价。峰值体验的最佳时机有哪些：转变事件、里程碑事件、低谷事件。 如何才能打造峰值体验？峰值体验才会让人产生“记忆隆起”，打造峰值体验的四要素：欣喜、认知、荣耀、连接。 欣喜时刻，提升感官享受，在视觉、味觉、听觉或是感觉等方面做到超乎寻常；增加刺激性，添加有助于提升效率的压力；打破脚本，打造意料之外，情理之中的奇妙体验。 认知时刻，被现实绊倒，把注意力放到“问题有多严重”上，可能问题就可以解决了，真相才能让人觉醒；突破认知，自我突破让你了解自己的能力和极限。“高标准+信心”的导师会点亮你的认知时刻。 荣耀时刻，认可他人，真诚的赞美会给他人带来莫大的力量；多设里程碑，人们对于里程碑式的时刻天生就有一种渴望，多设关卡，层级分明；锻炼勇气，享受荣耀前，你需要勇气，分层级的“暴露疗法”可以锻炼勇气。 连接时刻，共同使命感，使命感比工作激情更重要，使用感会让你觉得自己工作有意义；加深感情，心里医生亚瑟.阿伦的“36问”；宝贵时刻，珍贵时刻并不费钱，难得的是有心。 来自樊登读书","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"足球","slug":"pagezuqiu","date":"2020-04-07T07:02:42.000Z","updated":"2020-04-07T07:44:40.726Z","comments":true,"path":"2020/04/07/pagezuqiu/","link":"","permalink":"http://yoursite.com/2020/04/07/pagezuqiu/","excerpt":"","text":"","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"爬山","slug":"pagepashan","date":"2020-04-07T07:01:30.000Z","updated":"2020-04-07T13:42:05.053Z","comments":true,"path":"2020/04/07/pagepashan/","link":"","permalink":"http://yoursite.com/2020/04/07/pagepashan/","excerpt":"","text":"转自：https://www.codoon.com/iec/article/4qQWmNG49vg=觉得这篇文章写得不错，直接转了。 一. 登山技巧准备活动在开始登山前做一些热身活动是很必要的，这一点也往往被大家所忽略，其后果就是崴脚、关节、肌肉，韧带损伤等。所以在山脚下可以利用10—20分钟做一些肌肉伸展运动，尽量放松全身肌肉，活动的内容包括，全身各主要关节，韧带，肌肉的大范围活动，伸拉，放松，使心脏，关节，肌肉等进入运动状态。可以用双手手指戳揉膝盖下缘，以促进膝关节润滑液的分泌，这样攀登时会觉得轻松许多。 上山姿势上山时，上半身放松并前倾，两膝自然弯曲，两腿加强后蹬力，两臂配合两腿动作协调有力地摆动。同时，尽量让脚后跟吃劲，脚后跟自然就在人的重心上，于是身体的重量就能分配在大小腿乃至腰上，这比用脚前掌爬山要省1／3左右的力。爬坡时两脚迈步可以有点外“八”字 外“八”字式迈步便于让脚跟吃重，也可以减少脚面与小腿的角度而使肌腱舒服。如果在途中遇到突出块石头、石埂之类，要用脚跟踏之。若坡路较平，也尽量全脚掌着地。避免用前脚掌，这等于让小腿累死而让大腿闲死。坡路上常会突出石头、石埂之类，要用脚跟踏之。若坡路较平，也尽量全脚掌着地。同时，学着用用手减轻双腿的负担，当坡度超过45度，可以考虑手脚并用，省劲有效。 下山姿势下山时，上半身正直或稍后仰，膝微屈，脚跟先着地，两臂摆动幅度稍小，身体重心平稳下移，坡度较陡时上下山可沿”之”字形路来降低坡度，采用侧身走，重心略靠后，稳住一脚再移一脚。或考虑坐着走，两手撑地着移动，用屁股蹭着一点一点的下。 速度与节奏上山不可急：有的人喜欢在一开始就迈大步前进，一步当作两步走，结果上升不到50米就大汗淋漓，气喘如牛，遇到平坦的地方就停下来喘气，这样看起来爬得很快，但其实并不快。建议大家上山慢慢行，一步分做两步走，遇到台阶，哪怕是最小的台阶，都不要一步迈两个台阶，要一个一个台阶的走，遇到上坡，要尽量增加步伐的数量，但是切记不可休息。下山需放松：下山时可以结合登山杖运用多种姿势下山，同时一定要控制住自己的脚步，切不可冲得太快，这样很容易受伤。平路要快行：遇到前的平坦路途，如果累了就简单的休息一下，如果感觉还可以，就加快步伐前进吧，你在山坡上没浪费过多的精力，步伐轻快而迅捷。 二. 营养补给食物参加户外徒步登山活动时消耗的能量若没有获得适当的补充，容易使人的血糖降低，进而引起恶心、晕眩甚至抽筋等不良反应；除此之外，山上的事情谁都很难预料，因此不论目的地的远近，我们都需要带上一些行动粮以备不时之需。两天以上的长线活动食物计划遵循”高能量、高压缩比、耐储存”的原则。能量是基础，至于一般情况下，同样重量的面比米能提供更多热量。户外运动携带食物的原则或特点： 1) 体积小：因为食物需要自己携带，所以要求装备及物资的体积一定要够小，否则你的背包将没有空间去装其他的装备。比如，压缩饼干虽然味道不怎么样，但体积小能有效充饥，一块小小的压缩饼干就能满足成年人至少一到两顿的需求。2) 能量高：一个成年人在进行户外运动时，一天应摄入4000～6000卡的热量。同样，我们的背包空间是有限的，携带过多的食物，将会增加背负负担。因此，所带食物要能提供足够的热量。比如，巧克力作为一种休闲食品，它不仅能为日常膳食提供能量，而且还能提供许多能满足人体基本需求的矿物质和营养素。一块50克重的巧克力所提供的能量约为200千卡，相当于1.67两(84克)粮食所提供的能量，同时，它能能及时补充肌肉中消耗的糖元，帮助恢复体力。3) 耐饥：牛肉干是个不错的选择，除了拥有足够的热量、蛋白质及碳水化合物以外，风干的牛肉重量轻、体积也较小。方便食用：在艰苦的户外环境中，最好的食物是简单处理就能食用的。如方便面、火腿肠等，建议大家可以多备上一些。同时还应注意下环保以及野外安全等问题。 水分一般来说，一日的短程线路（按25km内计算），大约至少需要3瓶矿泉水（一般500ml一瓶）。不建议携带运动功能性饮料，白开水、矿泉水、纯净水就行，或者野外的泉水；注意，不要等到渴了再喝，应该坚持每隔20-30分钟喝一次、每次150-200ml的原则补水。 三. 急救安全 “野外无小事”，在户外徒步的过程中，任何一个小的问题的发生，都有可能导致大的事故。尤其是在野外遇到突发性的病人或伤者，要根据不同情况采取相应的急救措施。 首先，受伤时请记住简单粗暴的RICE法则，这个法则不仅仅适用于户外事故中，任何情况下出现受伤都可以采用此方法。因为在受伤时，人往往会不知所措，甚至可能会造成二级伤害。 RICE法则是分别取Reset（镇静）、Ice（冷敷）、Compression（按压）和Elevation（上举）的英文单词首字母组成的应对举措。 Reset镇静让疼痛部位镇静下来有助于促进恢复。如果后面的行程还需要依靠自己力量前进，就需要考虑身体的活动范围，用胶带等将伤痛处固定起来。 Compression按压对患处给予适度按压可控制浮肿和炎症。如果按压导致浮肿加剧，则减轻力量，观察状态。 Ice冷敷冷敷可以缓解疼痛，对炎症也有抑制效果。但是攀登雪山时注意不要过度冷敷，但可用饮用水浸湿毛巾后敷于患处。 Elevation上举上举在行动中比较困难，但在休息时可将伤痛处上举到高于心脏的位置，通过重力来控制浮肿和炎症。 在了解了RICE法则后，下面我们就来具体问题具体处理： 处理肌肉拉伤和膝盖扭伤拉伤和扭伤几乎是户外运动最常见的损伤了，通常会发生在不平坦的地面，或者岩石的边缘，当然在公园的足球场也很常见。要做好充分准备，就需要带上一包干冰袋来减轻肿胀。如果手边没有任何东西来作为夹板让扭伤部位固定，那就找一块木头来代替。比如你手指扭断了，那就找一根坚硬的树枝和一些医用胶布来支撑。如果你的手臂骨折了，可以将报纸卷起来，甚至用毯子来支撑。记住，要提高扭伤、骨折的部位来避免大量血液流向损伤区域。 处理割伤和抓伤在野外，你可能会在不经意间被锋利的树枝划破脸；在爬山的时候跌倒，划破膝盖；在“安营扎寨”安装帐篷的时候，可能也会意外地用小刀割伤自己的手。这就是为什么长距离户外活动一定要做好未雨绸缪的准备了。首先你要清洗伤口，保持伤口干净，然后再寻求专业帮助，或者回到家后做后续处理。止痛药、杀菌纸、绷带和医用胶带是你首要装入背包的户外急救品。 无论是跑步、徒步、登山、野营，水泡也是个常见的问题。如果出现水泡，要尽可能避免戳到它。早处理，你就可以抑制水泡扩大，这会让你在第二天有更少的困扰。如果可能的话，尽量使用饮用水、瓶装水来清理伤口，因为河流湖泊中的水可能会含有导致感染的细菌。 处理烫伤和晒伤无论你是太专心地在营地里烤肉串儿，还是在太阳下暴晒太久，你很可能都会面临被烫伤、晒伤的皮肤风险。如果你不小心被火灼伤了，一定注意要把伤口附近的衣服、首饰等物品移开，用冷水或温水来让伤口冷却。如果没有水的话还可以使用湿巾，不要使用冰袋。带一些止痛药缓解痛感，如果严重，要寻求医疗救助。 对于晒伤，你真的应该提前用防晒霜保护好皮肤。如果你真的被晒伤了，注意用冷的湿纸巾敷到晒伤区域，使用晒后修复霜以及包括芦荟或大豆成分的保湿霜来修复受损皮肤。 记住：如果你在一个大热天出门，带一个棒球帽为你的头部提供荫蔽保持凉爽。全身暴露的皮肤都需要涂上防晒霜，别忘了带足够多的水。 处理昆虫叮咬如果你在自然保护区徒步，或者在某个原生态的国家公园里露营，要做好被蛇虫鼠蚁光顾的准备哦～驱虫喷雾绝对是夏季必需品，要24小时将驱虫药水涂抹全身上下。特别需要注意别被蚊子、蛾子、野蜂、大黄蜂、蜜蜂等飞虫叮咬了！如果真的被它们亲吻了一口，可以使用抗组胺药和一个冰袋来抑制瘙痒。对于需要露营的驴友，一定要用蚊帐来堵住你帐篷的入口。愿意的话，你还可以带一个紫外线杀虫灯。","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"游泳","slug":"pageyouyiong","date":"2020-04-07T07:01:14.000Z","updated":"2020-04-08T12:53:04.998Z","comments":true,"path":"2020/04/07/pageyouyiong/","link":"","permalink":"http://yoursite.com/2020/04/07/pageyouyiong/","excerpt":"一直有游泳恐惧症，大学里没有学会，考试的时候是一路跳过去的；本来打算年后就学的，培训机构都选好了，结果碰上了疫情，目前正在用脸盆练习。 游泳入门教程教程一 水中行走这是初学者下水后的第一个练习，目的是体会水的阻力、压力和浮力，并初步学会在水中维持身体平衡的方法第一步：两手扶住池(岸)边或同伴的手，在水中行走。第二步：一手扶住池(岸)边或同伴的手，一手在体前侧做向外、向后划水，同时在水中行走。第三步：不借助任何支撑物，两臂在胸前左向外、向后的对称划水，双脚在水利做向前、向侧、向后的行走。在熟悉水性的同时，针对小孩还可以采取一些游戏性的项目，如跳水，水下钻杆等。 游泳入门教程二 学习呼吸不会呼吸的游泳不能叫做游泳，只能是“憋气”。正确的游泳呼吸是用嘴吸气、用嘴或嘴鼻呼气。站在齐肩深的水里，两手抓住池(岸)边;或者抓住同伴的手，用嘴深吸一口气，然后把头埋入水中，慢慢的用鼻呼气，直至将体内的废气呼尽，迅速抬头用嘴吸气。熟练以上技术，能做到连续、连贯、自然的完成多个呼气、吸气的技术，并且要求自己独立完成慢呼快吸的动作技术。","text":"一直有游泳恐惧症，大学里没有学会，考试的时候是一路跳过去的；本来打算年后就学的，培训机构都选好了，结果碰上了疫情，目前正在用脸盆练习。 游泳入门教程教程一 水中行走这是初学者下水后的第一个练习，目的是体会水的阻力、压力和浮力，并初步学会在水中维持身体平衡的方法第一步：两手扶住池(岸)边或同伴的手，在水中行走。第二步：一手扶住池(岸)边或同伴的手，一手在体前侧做向外、向后划水，同时在水中行走。第三步：不借助任何支撑物，两臂在胸前左向外、向后的对称划水，双脚在水利做向前、向侧、向后的行走。在熟悉水性的同时，针对小孩还可以采取一些游戏性的项目，如跳水，水下钻杆等。 游泳入门教程二 学习呼吸不会呼吸的游泳不能叫做游泳，只能是“憋气”。正确的游泳呼吸是用嘴吸气、用嘴或嘴鼻呼气。站在齐肩深的水里，两手抓住池(岸)边;或者抓住同伴的手，用嘴深吸一口气，然后把头埋入水中，慢慢的用鼻呼气，直至将体内的废气呼尽，迅速抬头用嘴吸气。熟练以上技术，能做到连续、连贯、自然的完成多个呼气、吸气的技术，并且要求自己独立完成慢呼快吸的动作技术。 游泳入门教程三 水中漂浮学习水中的漂浮技术，主要是体会水对人体的浮力，并初步掌握人体在水中的平衡能力，排除对水的恐惧心理。 游泳入门教程四 抱膝漂浮练习两脚站立水底，深吸气后，下蹲低头抱膝，两膝尽量靠近胸部，前脚掌蹬离水底，成低头抱膝团身姿势。身体要尽量放松，自然的漂浮于水中。站立时，两臂前伸，向下压水并抬头，同时两腿伸直，以脚触水底站立，两臂自然放于体侧。展体漂浮练习：两脚开立，两臂放松向前伸直，深吸气后身体前倒并低头，两脚轻轻蹬离水底，成俯卧姿势漂浮于水面，两臂、两腿自然分开，要求全身放松，身体充分展开。站立时，收腹、收腿，两臂向下压水，然后抬头，两腿伸直，脚触水底站立。 游泳入门教程五 滑行漂浮练习1、蹬边滑行漂浮练习：背向池(岸)边，一手扶住池(岸)边缘，一臂前伸，同时，一脚站立，一脚贴近池(岸)边。深吸气后低头，上体在水中前倾成俯卧姿势，大小腿尽量收紧臀部靠近池(岸)边，两脚掌贴住池(岸)边。与此同时，扶池(岸)边的手臂向前摆出与前臂并拢，头夹于两臂之间，这是两脚用力蹬出，成流线型向前滑行。要求：蹬离池(岸)边后，身体要充分伸展，并尽量放松、自然。2、蹬底滑行漂浮练习：两脚前后开立，两臂前上举。伸吸气后上体前倒，当头、肩侵入水中时，前脚掌用力蹬池底，随后两脚并拢，是身体成流线型向前滑行。3、练习手脚动作。如果是练习蛙泳，可以像视频里那样先在岸上把基本功练好。到了水里才不会慌乱。等这套动作已经成为一套自然连贯的运动，就可以下浅水区练习练习。总之，最终还是要把在水面上的平衡，换气以及手脚动作协调配合，完成游泳的动作。 蛙泳蛙泳配合有一个顺口溜，在讲解蛙泳动作要领之前先介绍给大家：“划手腿不动，收手再收腿，先伸胳膊后蹬腿，并拢伸直漂一会儿。”从顺口溜中可以看到，手的动作是先于腿的动作。一定要在收手后再收腿，伸手后再蹬腿。臂部动作：1、外划。双手前伸，手掌倾斜大约45度(小拇指朝上)。双手同时向外、后方划，继而屈臂向后、向下方划。2、内划。掌心由外转向内，手带动小 臂加速内划，手由下向上并在胸前并拢(手高肘低、肘在肩下)，前伸。3、前伸。双手向前伸(肘关节伸直)。要提醒大家注意的是：外划是放松的，内划 是用力的、加速完成的、前伸是积极的蛙泳的完整配合动作：双手外划时抬头换气，双手内划时收腿低头稍憋气，双手前伸过头时蹬腿吐气。腿部动作：1.收腿：屈膝收腿，脚跟向臀部靠拢，小腿要躲在大腿后面慢收腿，这样可以减少阻力。收腿结束时，两膝与肩同宽，小腿与水面垂直，脚牚在水面附近。2,翻脚：两脚距离大于两膝距离，两脚外翻，脚尖朝外，脚牚朝天，小腿和脚内侧对准水，像英文字母“W”。3.夹蹬水：实际上是腿伸直的过程(屈髋、伸膝)，由腰腹和大腿同时发力，以小腿和脚内侧同时蹬夹水，先是向外、向后、向下，然后是向内、向上方蹬水，就像划半个圆圈。向外蹬水和向内夹水是连续完成的，也就是连蹬带夹。蹬夹水完成时双腿并拢伸直，双脚内转，脚尖相对。蹬水的速度不要过猛，要由慢到快地加速蹬水，两条腿将近伸直并拢的时候蹬水速度最快。4.停：双腿并拢伸直后在一个短暂的滑行(1-2秒)。 自由泳游泳是全身运动，任何一个部位的活动都离不开全身的协调配合。从表面上看，自由泳依靠划水和打腿产生推进力，实际上，躯乾的作用也不能忽视。首先，躯乾应保持一定的紧张度，腰部如果松软，整个人就像一摊泥一样。其次，身体的转动能够有效地发挥躯乾部大肌肉群的力量，减少阻力，提高工作效果。自由泳的完整配合有多种形式。一般常见的是每划水2次，打水6次，呼吸1次。1、手的入水点在肩的延长线和身体中线之间，以大拇指领先，斜插入水。2、入水后，手、肘、肩继续前伸，使手臂伸展。随著身体的转动，屈腕、屈肘，手臂向 外、后方抓水;手下划到最低点后，旋转手臂向内、上、后方划水，保持高肘屈臂的划水姿势。3、手臂与水平面垂直时，经手领先，加速推水，手臂转为向外、向 上和身后划水直到大腿侧，提肘出水。4、出水后，手臂自然、放松地经空中向前移臂，保持高肘姿势。然后手在肩前领先入水，开始下一个动作5、手臂在水下成曲线划水路线，从侧面看，手相对于身体的划水轨迹为“S”形。6、自由泳两臂配合有前交叉配合、中交叉配合、和后交叉配合3种基本形式。本图为前交叉形式，为初学者比较容易掌握的方式。 单臂打水划臂动作是初学者应该重点练习的动作。如此图，左臂划水，那么可以右臂扶板。一般腿打水10产次左右，手臂划水一次。掌握到一定程度的时候可以加上呼吸练习。1、打腿动作从髋部开始发力，大腿带动小腿，做鞭状打水动作。2、向上打水腿从直到弯。以直腿开始向上打，脚接近水面时屈膝，小腿上抬，使脚牚露出水面后向下打水。开始可直腿打水，但腿略放松，不要僵硬，在水的压力下腿会自然弯曲。向下打水前膝关节弯曲角度约130-160度，打水幅度约为30-40厘米。打水时要绷脚(芭蕾脚)，不要勾脚。 仰泳仰泳，又名背泳，是一种人体仰卧在水中的游泳姿势。仰泳包括反蛙泳和反爬泳，因为脸面在水面上，呼吸很方便，但是游泳者看不到在往哪里游，容易错方向。1、臂划水时，出水以大拇指领先，移臂时手臂与水面垂直，上臂贴近耳朵。移臂过程中手臂旋转，入水时小拇指领先插入水中。2、如果以头的位置为钟表12 点，两手的入水点在11点和1点的位置。手入水后先直臂下划。3、两臂划水应与身体转动协调配合，两肩不断形成位置差。4、两臂划水配合采用中交叉方式， 即两臂始终处于相反的位置，一臂划水时，另一臂移臂。5、头部保持稳定没有左右摆动。6、呼吸虽然不受限制，但最好采用有节奏的呼吸方式，或以固定在一臂移臂时吸气。毕竟划水以及身体在水中行进时会有波浪及水花。随意呼吸易呛水。7、保持 水平的身体姿势，躯乾和肩随手臂动作围绕纵轴转动，始终有一肩不露出水面。8、一般每划水2次，腿打水6次，呼吸1次。9、两腿交替做鞭状上下打水。向上 打水要快而有力，脚略内旋并绷直，向下打水时腿和脚自然放松。10、移臂时手臂紧贴身体不能太宽。11、移臂时如果手臂易弯曲，则可暂时用小拇指领先出水，养成直臂出水的习惯以后再用大拇指领先出水。12、身体始终保持伸展、正直、几乎水平地仰卧于水面，好像平躺在床上，头下有一只矮枕头。建议：仰泳腿要体会大腿用力，上抬与下压都要有，体会大腿带动小腿的感觉 蝶泳蝶泳在4种竞技游泳姿势中是最后发展起来的泳姿。由于它的腿部动作酷似海豚，所以又称为“海豚泳”1、蝶泳的手入水点在两肩的延长线上，以大拇指领先，斜插入水。2、入水后，肩、肘前伸，两手沿曲线向外、后、下方抓水。两手分开到肩宽时，屈肘，加速划水。3、两手分开到达到最大宽度后，手臂转为向内、向上和向后划水，手臂上抬时保持高肘屈臂。两手在胸下或腹下时，手之间的距离最近。4、呼吸与划水的配合也是蝶泳技术的关键。手臂结束向内划水时，头露出水面吸气，移臂时头还原入水。记住两个“之前”，即头在手出水前出水，在手入水前入水。5、蝶泳双手划水两手距离接近最近时，手臂划水的方向再一次改变，转为向外、向上和向后划水，直至出水。6、划水出水后，手臂在肩的带动下经空中向前移 臂，准备入水、移臂一般以低、平、放松的姿势从两侧前移。7、蝶泳的身体姿势掌握比较难，同时鞭状打水也不易掌握。在蝶泳学习的时候，我们会有专门的分解 练习让您逐步掌握运作。8、蝶泳的划水路线一般为“钥匙孔”形，指两手在胸下或腹下时的距离最近，这种前后划水路线比较均匀。9、注意蝶泳的四肢动作是双臂、双腿同时协调发力。","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"篮球","slug":"pagelanqiu","date":"2020-04-07T07:00:45.000Z","updated":"2020-04-07T07:41:58.436Z","comments":true,"path":"2020/04/07/pagelanqiu/","link":"","permalink":"http://yoursite.com/2020/04/07/pagelanqiu/","excerpt":"","text":"","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"跑步","slug":"pagepaobu","date":"2020-04-07T07:00:35.000Z","updated":"2020-04-07T07:42:38.347Z","comments":true,"path":"2020/04/07/pagepaobu/","link":"","permalink":"http://yoursite.com/2020/04/07/pagepaobu/","excerpt":"","text":"","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"羽毛球","slug":"pageyumaoqiu","date":"2020-04-07T06:59:59.000Z","updated":"2020-04-09T11:56:47.127Z","comments":true,"path":"2020/04/07/pageyumaoqiu/","link":"","permalink":"http://yoursite.com/2020/04/07/pageyumaoqiu/","excerpt":"转：看过很多羽毛球视频，当推李在福。李在福教练《追球》系列全部视频提炼“干货”，作为知识要点赋存，时刻方便加以提醒和复习，奉献各位羽毛爱好者。 1-1 正确的态度 1）要能挑战强者； 2）要能尊重弱者。 1-2 握拍1）错误的握拍，会导致大幅度的挥拍，正确的握拍，会使挥拍集中而短促。所以，握拍必须通过变换来适应不同的击球位置；2）五个手指，拇指和食指是控制手指，其余三个是发力手指；3）比赛时候，变换正反手握拍的时间很短，所以要快；在具体做时，要先放松拍子，然后再变换握拍才能快，而不是用手指来转动拍子再握住，那样太费时间；4）击球需要柔和时，握拍也应该相应柔和，如网前球；反之，要着重发力时，如杀球，则应该手指抠紧球拍。","text":"转：看过很多羽毛球视频，当推李在福。李在福教练《追球》系列全部视频提炼“干货”，作为知识要点赋存，时刻方便加以提醒和复习，奉献各位羽毛爱好者。 1-1 正确的态度 1）要能挑战强者； 2）要能尊重弱者。 1-2 握拍1）错误的握拍，会导致大幅度的挥拍，正确的握拍，会使挥拍集中而短促。所以，握拍必须通过变换来适应不同的击球位置；2）五个手指，拇指和食指是控制手指，其余三个是发力手指；3）比赛时候，变换正反手握拍的时间很短，所以要快；在具体做时，要先放松拍子，然后再变换握拍才能快，而不是用手指来转动拍子再握住，那样太费时间；4）击球需要柔和时，握拍也应该相应柔和，如网前球；反之，要着重发力时，如杀球，则应该手指抠紧球拍。 1-3 站姿1）渴望的、认真的站姿。双脚分开，膝盖弯曲，上身略前倾，精力集中；2）右手（持拍手）最好离开身体，不要收回来，不能太靠近身体。为了能做到这一点，可让自己的手肘向外扩一点，这样就会保证右手不会无意识的收回；3）不要忘记左手的作用——平衡和增加击球力量。 1-4 羽毛球的移动1）有三个不同的速度，第一，我的移动速度，第二，球的飞行速度，第三，对手的移动速度。所以要根据球和对手的移动速度来决定我的移动速度；2）如何启动，这是非常关键的。当对手击完球的一瞬间，我必须要有一个蹬地的步伐，即轻微小跳两腿略分重心放低的一个动作。即无论要移动到哪个方向，移动之前，都需要这个最初的蹬地。 1-5 击球的技巧1）力争能够在身前击球。因为，只有在身前击球，才能在看到球的同时全局性的掌控场地和观察对手；2）力争能够离开身体击球。只有离开身体击球，才能有效的利用手臂和拍子的长度，也才能减少移动，从而更快的击球，也会感觉球场会变小。 2-1 羽毛球与生活1）爱、挑战、竞争，是羽毛球与生活的共通之处。 2-2 教练的态度1）教练就像一位父亲，有爱心，关爱学员。 2-3 选手的态度1）选手不能在一场比赛中，给自己的极限定位，而是应该不断的调整与超越，即使是面对比自己很强的对手，也应保持信心，积极拼搏；2）如果你认为自己是个普通人，用普通的训练方法，那么你就是个普通的选手；但是用另外不同的想法，用不寻常的训练方法，那么你就会是个不寻常的选手。 2-4 训练的态度1）在训练自己的身体的同时，更要训练自己的意识，比如站姿放低，集中注意力于来球等；2）训练中球的连贯性的练习，非常重要，比如杀球完毕后的准备。 2-5 练习时想些什么1）视野要开阔，比如练习反手网前，那注意力要同时兼顾正手网前和其他两个远角，如果注意力能够故意反而放在其他三个角落，则更是事半功倍；2）与上点所连贯的总结是：重要的是练习的质量以及练习时的意识层次，练习时的意识是最重要的。 2-6 如何控制全场1）身体准备好了直线，但你的注意力的60%-70%则放在斜线上，这样你就能控制全场，其他类似的情况也是如此处理，即应该保持“形近神远”的原则。 3-1 杀球1）握拍及视线。拇指略圆润，食指略弯曲，握拍要从自然握拍向内旋转10度左右，同时保持击球点在身前，从而保证拍面的垂直击球。挥拍的整个过程里，左臂稍微向外转，相应右臂也逆时针转动，使得身体稍微朝向球网，从而让视线可以同时观察到来球与对手；2）停顿。杀球之前，拍子瞬间停住，就能产生更多的力量；3）左手。击球之前，如风车轮转一样先左后右。左手挥下后，基本停在侯球的位置，不要摆到身后，否则将影响身体的平衡；4）脚步。为了更有力的杀球，身体重心要从右脚移动到左脚。 3-2 反手网前搓球1）要用手指肚来握拍，因为手指这部分感觉比较灵敏；食指和拇指都要伸直！需要两个手指从拍柄的两侧来控制球拍。这种球不是平行移动拍子，拍子的轨迹要接近半圆，同时，手指需要捻动拍柄。为了使球更转，拍子要从正手位划弧移动到反手位，是个比较大的移动，即从右到左，不要从中间开始；2）步伐。当击球的时候，右脚要同时落地，会更加稳定性和控制性。 3-3 正手网前搓球1）握拍。要轻松柔和，用指肚来掌握，和反手网前搓球一样，食指和拇指都是直的，不要弯曲；2）挥拍。这种球最好拍子的轨迹要接近半圆，不是平行移动拍子；3）击球点。击球点要保持在身前，而不是身侧，否则很难搓球；同时，尽可能的提高击球点，这样就更安全；4）站姿。站姿要注意的是，视线和击球点的高度要接近； 3-4 中后场反手平抽1）如何击球。反手平抽的目的，是在最短的时间内将球击到对手的空位，要越快越好。因此，如果想要击球很快，则必须要快速的闪动球拍，而不是拍子随球移动出去，即击完球的那一刻，拍子不要随球出去，也不要停，而要向后收一下；另外，击球前，拍子应先暂停一下，再闪动击球；为了能做到这样击球，击球点要稍微在身前一点；为了做到身前击球，步伐上要先平移脚步然后再迈右腿，而不是直接迈右腿，否则将导致侧身击球的情况出现；2）为了能利用手腕的力量，站姿和手腕的位置很重要。手腕要低于拍头，这样手腕可以外旋转动；同时，击球点和视线要接近同一水平，即根据击球点的高度来调整人站姿的高度；3）握拍。反手握拍是网前扑球所采用的，不适合反手抽球，所以，要采用自然握拍来反手抽球；4）步伐。脚下的步伐和反手网前扑球很接近，最初的一步是要蹬地（看球），然后跨步，击球；击球完毕回来时，同样应小步蹬地过渡回来，会比较快；5）击球点要离开身体，会使击球的力量增加。 3-5 半场平抽1）首先，站姿应该正确，握拍应该是自然握拍，拍头应该在身体的中间，对这种情况来说，这是最好的位置；2）对自己身在半场接对手来球的情况，右脚（持拍脚）要向前，这对进攻和防守都一样；左脚也可以在前面的时候，这时，是你的球过网后低于网，对手不能进攻；3）一般情况下，这种时候是不期望直接得分的，主要目的是创造杀球机会，所以快速的反应是最重要的，短促快速的动作要比大力的击球更重要。 3-6 网前扑球1）站姿。脚下要站开一些，保持稳定与饥渴的姿态；2）双臂的位置。持拍手的拍头要指向来球，拍子的高度要稍微比网高一点点，不宜太高；拍子要离开自己的身体；最重要的一点需要记住的就是快速的动作，敏锐的反应；左手要撑开，保持身体平衡；3）击球。网前球手指的力量要比手腕重要的多，手腕的力量是用在中场和后场球；4）一个重要的细节。击球前的一瞬间，要有一个暂停，这个细节的掌握程度决定了你是不是高手；5）最后，最重要的一点，饥不择食的意识。 3-7 接杀防守1）站位。不要站在正中间，要后退一步，这是最好的接杀位置。正好是考虑到拍子的长度后的一个比较适合的接杀位置，如来球更高，比如到胸部的高度，则会出界；最重要的一个原因，站的稍后，有手臂和拍子长度的弥补，则触球点的位置恰好刚刚好；2）站姿。站姿应该矮一些，要向前看。对方击球前，可能是杀球、平高或吊球，相比之下，杀球最危险，所以，正确的做法是拍子要略低些，防杀为主；3）脚步移动。对手杀球后的一瞬间，必须做出一个定向的准备动作，即迅速的双腿略分开重心降低产生蹬地作用的一个过程，从而做到下一步的快速的蹬地启动，不要仅仅站着接杀；4）击球技巧。接杀主要是手指的力量，而不是手腕，手腕动作太大太慢；另外一点，球来了，拍子不要向后引拍，就要从摆拍的位置开始，直接向前挥动；5）心态。你的心态要像深深的湖底一样，因为湖底很深，所以没有声音，没有惊慌。 3-8 放网前球需要说明一下的是，放网是指那些击球点离网有一点距离的球，这种情况下，重点是安全的击球，而不是试图搓球，搓球适用于击球点离网很近的情况。因为就算你搓球，球过网之后旋转也会停止。1）击球技巧。在击球的那一刻，应该感觉到从肩膀到拍头是一个整体，不要用手腕来控制来球；同时，最好身体是站稳来放网，这样击球的准确性就不会受到身体移动的影响；2）为了有更好的球感，击球点的高度应该和视线的高度接近；3）保持击球点在你身前，脚指头要指向球的位置；4）利用你的左手。撑开左手，保持身体平衡。 3-9 正手低手位平抽1）应小幅度挥拍，利用完全一致性的动作，分别打出直线、斜线、挡网等多种类型的球。即，拍子先伸出就位，然后手腕迅速抖动发力；大幅度的挥臂挥拍，只适用于这个位置的高于网的球；2）由于时代和器材的不同，以前的拍子很重，击球时挥拍的幅度要大，身体的摆动也大，现在则应该简练、快速，所以也更隐蔽。 4-1 正手假动作网前勾对角1）顺序是这样的：让对手看到我要击直线球，然后看到我要挑球，最后做勾对角，总共有三个动作在这里 ，这会使你的球更有欺骗性；2）重要的一点是，尽快地到达位置，尽可能延长控球的时间，当球离开对手时，自己立刻移动，越快越好，当我维持这个姿势时，我的对手无法移动，我在控制着球的同时也在控制着对手；对于这三个动作，后两个的时间间隔要短，才有更好的欺骗性。 4-2 反手假动作网前勾对角同正手。 4-3 双打反手发网前小球1）用两根手指捏住一根羽毛，其他三个手指自然伸直；球头最好指向膝盖的位置，不要垂直向下；握拍最好靠前，不要靠后，握拍靠后的话，不太容易挥动；准备好后，用手腕挥动球拍，不要用手臂，手臂要固定在那里；如何击球？最好是推，很柔和的推出去，不需要击打球，击打球的话，不容易控制好准确性；2）发球时，脚的位置并不是最重要的，舒服就好，重要的是发完球后脚的准备姿势要立刻就位；3）如果你个子比较高，可站近些发球，如果个矮，应该稍微后退一些；4）发T位置，是一个最常发的点，但也要偶尔发边角；发边角，准备的动作是一样的，不同点在于击球一刹那，左手转动球头使球头指向侧面，拍面略随之变化，隐蔽性就比较好了，即准备是一样的，只是击球的瞬间改变角度；如果你能做到这样发球，对手就不得不准备两边，导致其的反应时间就长一些；5）另外，有些高水平的球手，会采用另一种发球技术，即不垂直拍面推球，而是切击球，这样做，会使球速加快并增加旋转；还有人，左手整体持球，然后从反手位切球，使球有点飘，增加对手回球的难度；总之，发球时最重要的一点，就是尽量不要失误，安全的发球，就是最好的发球，避免一些华而不实的发球，尽管高难度的发球会给对手增加压力，但同时也使自己发球的失误增加；发球的关键是，要对自己的发球有信心，相信自己的发球，不要担心被对手攻击，不管对手有多快，如果你能发个很平很好的球，对手就没有机会进攻，记住，相信你的发球！ 4-4 单打正手发网前小球1）用手轻轻的握住球，使球垂直下落；2）考虑到拍子长度的影响，右手长度要减少一些，同时，左手的长度要伸长一点，这样来保持左右两个长度比较接近；3）如果击球点太低，球会容易向上走，比较好的做法是稍微侧一点，使击球点高一点，不要太低；4）单打时，选手必须要控制全场，发球时的站位最好要靠后一点，发完球，立刻准备好接球，所以单打发球，站位不要太靠前；5）还有另外一种发小球方式，可以做假动作，即用发后场球的姿势来发网前小球。 4-5单打正手发后场高球1）重心应该先在右脚，发球的过程中，过渡到左脚；2）击球的拍面，应该垂直于球托，直来直去；拍头，基本上应该朝下而不是朝右；3）如果前后摆动的话，就更准确更容易控制，而不是仅仅只有由后向前的单向移动，所以，拍子从前面开始，先向后，再向前，这样节奏会比较好。 4-6 双打接发球——平射球1）站姿上两腿要分开一点，不要太近，否则移动会慢；两膝盖略弯曲；自然握拍；2）当对手发球时，最重要一点是启动时的一瞬间，快速的蹬地向后移动，这个蹬地的动作使你的速度加快，而不是“迈”出去；3）接球过程中，快速的垫步移动，第一，可以使你的移动更快，第二，给你一个加速度；对手高球过来，更是应该快速垫步，然后起跳杀球；4）当你认为对手会发平射球时，就没有必要做通常的准备姿势，而是可以略转换成正手握拍，直接封堵；所以，关键的是，你要分析对手，注意对手要对你做什么，然后你的站姿，位置、握拍等，根据对手的意图都要做适当的调整。 4-7 双打接发网前小球1）站姿。重心60%在左脚上，40%放在右脚，重心不要在中间，身姿略前倾，但是不要前倾过度，否则对付平射球会比较麻烦；2）两手要一起伸向前面，不要收回来，要伸出去；3）对手发完球后，最初的动作要蹬地，为了获得加速度，这种蹬地的动作是必须的，不要直接走过去；4）站立的姿势要侧身，不是面对面，否则前后移动会很慢；5）如果站位比较靠前，接球的时候，可以直接跨左脚出去，会比较快；如果稍靠后，应该跨右脚；要先出拍，后出脚；即，蹬地第一，出拍第二，出脚第三；击球时要注意的一点是，手腕要立住，这样球就会平着出去，即手腕立住点击来球，这样球就会比较平；另外，如果你这样强攻的话，击球完毕，你的责任就是网前，两脚应该平行站位候球了；6）假设站在右场区候球，如果对手球发到T的位置的话，一般你用反手接球，如边角的话，用正手接球，准备的时候，握拍要是自然握拍，即准备时保持自然握拍，然后根据来球来改变握拍；打对手的追身，是个不错的选择。 4-8 单打接发后场球1）单打接发后场高球，最重要的一点是要尽快赶到球的后面，这样就有时间做假动作、有利于大力击球、能提高准确性，另一点，如果能尽快赶到球的后面，就意味着有更多的时间等待，那么就更有隐蔽性；2）比较好的办法是快速的启动，尽快的赶到球的后面，然后轻松等待，即“先紧后松”；人不应该和球一起移动，而是应该快于球、先于球，这样的击球才有隐蔽性。 4-9 单打接发网前小球1）快速启动。要蹬地启动，尽快接到球；同时，因为并不知道对手是发小球还是后场球，所以，重心应该放在中间；2）用最短的路线，将拍子送到击球点；3）接球来讲，安全的接球是最好的处理，不要试图回个难度很大的贴网球或仓促的击球。安全第一，不要玩花样，导致过多的失误。 4-10 双打进攻站位双打的站位可以分四种情况：进攻、连续进攻、防守和互相帮助，下面，以进攻这种类型为例进行分析；1）前场队员封网后，如对方回球到己方后场时，前场队员应该相应后退，与后场队员保持稳定的距离，这样就能照顾更大的面，否则如果继续呆在前场不动，那么对手一旦下一拍回到两腰的位置，将很难处理；如后退之后，对手放网怎么办？不要紧，放网的球速比较慢，只要你准备好了对付快速球，那么你对于网前的慢速球就肯定没问题；2）当觉得后场同伴主动的时候，不要考虑后场，集中精力负责前场，首先要注意拦截中场球，同时照顾网前扑球，OK了就。 4-11双打如何帮助前场队员下面讲的是前场被动时后场队员如何帮助前场队员。1）后场队员要随前方队员做相应移动，随时准备击球；比如，前方队员移动到左前方，后场队员则应该采取人在球场中间略偏右的后方、同时面对左前方的姿势，随时准备扑网，但这里要注意，你向前移动并转体帮助前场队员的同时，不要忘记后场，后场是你的主要责任。 4-12 双打如何帮助后场队员1）感觉后场同伴比较被动时，此时应该背对他，负责另外三个角，而且要略后退一些，有些类似单打，这是双打轮转的最佳时机；同时，当同伴后场被动，你这样移动准备帮助同伴时，无论如何不能忘了，前场是你的主要责任，你准备帮助同伴后场的同时，不能忘了前场，即，不要忘了你的主要责任。","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"乒乓球","slug":"pagepingpangqiu","date":"2020-04-07T06:59:48.000Z","updated":"2020-04-08T09:43:23.284Z","comments":true,"path":"2020/04/07/pagepingpangqiu/","link":"","permalink":"http://yoursite.com/2020/04/07/pagepingpangqiu/","excerpt":"来自于唐建军博士乒乓球教学视频。 1身体姿势和站位及握拍方法两脚与肩同宽或者略宽，腹部微收，重心压在前脚掌，不要提起后脚跟，膝关节微曲。近台站位：40-50cm 中台站位：100cm左右 远台站位：&gt;100cm接发球时站在球台偏左处，接球后，需要根据比赛的情况有不同站位。直握：左推右攻传统标准握法（后面中指顶住并弯曲）、大钳（深握，便于发力）、小钳握法（虎口很小）。直拍横打握法的区别，后面要求两个手指略直顶住，便于发力。 2.攻球、进攻技术a.正手攻球 站位：40-50cm 右脚略偏后，左脚前，相差半个脚掌，脚与肩宽，或略宽。 动作结构：引拍、挥拍击球、随势挥拍。要以身体带动手引拍，挥拍向前时，（重心在）右脚蹬地，转腰快速挥臂向前上，碰球时要快速。 击球时机：击球上升期、高点期、下降期。三个时期动作越来越大，离台也越来越远。 击球力量：轻打，中等力量，发力打。b.反手进攻 直拍攻球或横打：反手攻球，压住拍子，手腕不要翘起，而是下垂，向前上挥拍，转腰。 直拍横打，注意把球拍亮开，手腕下垂，抬前臂。 c.正手位走动中进攻 步法技术和手法结合，跳步或者跨步（个高用跨步），注意要先抢位脚落地后再击球，另外需要让位要充分。比如：侧身不充分。d.正手杀高球 机会球要杀高球，注意要引拍，由下引向上挥，击球再向下挥，在上升或者下降击球。","text":"来自于唐建军博士乒乓球教学视频。 1身体姿势和站位及握拍方法两脚与肩同宽或者略宽，腹部微收，重心压在前脚掌，不要提起后脚跟，膝关节微曲。近台站位：40-50cm 中台站位：100cm左右 远台站位：&gt;100cm接发球时站在球台偏左处，接球后，需要根据比赛的情况有不同站位。直握：左推右攻传统标准握法（后面中指顶住并弯曲）、大钳（深握，便于发力）、小钳握法（虎口很小）。直拍横打握法的区别，后面要求两个手指略直顶住，便于发力。 2.攻球、进攻技术a.正手攻球 站位：40-50cm 右脚略偏后，左脚前，相差半个脚掌，脚与肩宽，或略宽。 动作结构：引拍、挥拍击球、随势挥拍。要以身体带动手引拍，挥拍向前时，（重心在）右脚蹬地，转腰快速挥臂向前上，碰球时要快速。 击球时机：击球上升期、高点期、下降期。三个时期动作越来越大，离台也越来越远。 击球力量：轻打，中等力量，发力打。b.反手进攻 直拍攻球或横打：反手攻球，压住拍子，手腕不要翘起，而是下垂，向前上挥拍，转腰。 直拍横打，注意把球拍亮开，手腕下垂，抬前臂。 c.正手位走动中进攻 步法技术和手法结合，跳步或者跨步（个高用跨步），注意要先抢位脚落地后再击球，另外需要让位要充分。比如：侧身不充分。d.正手杀高球 机会球要杀高球，注意要引拍，由下引向上挥，击球再向下挥，在上升或者下降击球。 3.发球技术a.转与不转发球：脚左前右后，注意要抛球和引拍（便于利用身体的转腰动作），不引拍则球不会很转。向前下方挥拍，拍稍后仰（140度左右），击球点在身体正前方偏后一点。 注意：用球拍中下方磨擦；发力前要放松，磨擦时再发力；挥拍速度在触球瞬间最大。 错误：球下网可能击球点偏低或者第一落点太靠近网。 不转发球：方法1触球点在球拍中上面；方法2触球时挥拍方向变化（变成水平）。b.横拍 使有效手腕运动得到充分的发挥。c.反手位：两脚平行或者左脚稍后退半步。由后上向前下挥拍，在身体侧前方击球。d.侧（上、下）旋发球：左脚前，右脚后，核心在于挥拍由后上向前下侧方挥拍。侧下旋发球：球拍后仰（球拍中下部分磨擦球）；侧（上）旋球拍立起，磨擦球的侧方。横拍可以把下面的三个手指握拳头放在掌心，增加手腕的灵活度。e.反手侧旋发球同反手发转球。唯挥拍方向不同。 4.控制技术a.慢搓技术 近台，脚平行，球拍后仰，挥拍方向在胸腹前由后上向前下，在球的下降前期击球。注意好击球时机，避免击球过早或过晚。直拍时，手腕可以发一点力，但不能使用过多。慢搓无正手？b.快搓技术 击球上升期（前期和后期皆可），可以加力加转。应当据有慢搓的基础。搓直线和斜线通过拍形控制。对方搓长球时，不要摆短（落点变化），而应用线路变化。c.摆短与劈长 摆短和快搓非常像（包括正、反手），对方球短才可以摆短，注意动作要小，要轻轻的碰擦球，不要追求强烈的下旋，而在于速度、弧线和落点。注意要上右步，然后还原，以防对方劈长，并利于自己进攻。横拍同。 劈长，加大力量即可。击球时间可以在上升后期，可以劈对方正反手位。力量不要太大太快，否则容易失误；引拍要小。 5.接发球技术（左脚在前，右脚在后）a.搓接 是接球的基础，用于接对方的下旋球。反手搓左脚在前要进左脚步，拍形要根据对方的旋转调整，挥拍由后向前略向下。 搓转球时，要触球时加大磨擦力，使球旋转加强。 正手搓接，引拍自后下向前下，注意右脚上步然后注意还原。迈步大小和位置根据球的长短来确定。b.推接、拨接 判断是否侧旋或者侧上旋？左脚在前，右脚在后。注意调整拍形，以免吃侧旋。可以打直线和斜线。c.摆短接发球 （包括正反手都要上步） 用于接对方的近网短球。短球一般发过来不会特别下旋，1判断是近网短球，2上步，3击球上升期。d.晃接 通过身体晃动欺骗对方，靠身体转动击球。接球点：中路近网或者反手位近网位。左前右后，注意上步，正手位上右步，侧身位上左步。e.挑打接球 具有攻击性，球不转或高弧球时可用。正手位时要1上右步，抢位 2不要引拍，球拍稍后仰3击球中间略偏下，向上摩擦，以手腕发力为主。触球时速度要快时间短，手臂和手腕在击球前要放松。 反手位挑打也上右脚。 6.推拨技术 上旋相持a.直拍推挡 站位：左脚稍前，容易照顾正手。食指压拍，姆指放松，拍形向前下。少用手腕弹击，由腹前由后向前上推，肘关节贴住，不要打开，打开就是反手攻球。b.横拍反手拨球 拍微内扣，不要竖起来，后下向前下挥拍，手腕不要用太多（只是略微发力，要求稳定，可以防弧圈和进攻），主要用前臂发力，肘不要抬太高，不要太贴住胁部（和直拍不同）。克服“反手利”握拍。c.反手加力推 用于推弧线高的球，发力向前多，向上少（甚至下压），略微加手腕发力。身体可略右转，增加发力距离（动力幅度大）。注意击球时机。d.反手弹打 直横皆可。手腕发力为主，后手指顶住球拍。瞬间发力，在高点期弹击弧线稍高的球的中部。注意击球时机。e.直横拍反手侧切 用于控制拉球，减少旋转强度，改变节奏。 类似推挡，挥拍由右腹向左侧前（上）方。不要先推再侧切。横拍一般不侧切，需要拍头上翘横移。f.反带（正手和反手） 用于控制弧圈球。球拍前倾，击球上升前期，用快速摩擦方式击球，不要引拍，或者小引拍。注意：落点要准确判断，身体前移及时。 反手快带时需要用手腕的力量，快速发力。不要出现手腕紧张，只用手臂带球的现象。g.荡弧圈技术 不用摩擦，只靠撞击。高点期或高点前期，小引拍，由后向前略微向上，主要借力打力，不要主动发力，相对比反带安全一些，根据球的旋转强度调整拍形。出手不要太低，略高一点，否则容易球出界。 7.弧圈球技术加转（高调）、前冲、侧旋弧圈。a.正手加转 击球下降期，弧线高，向上发力多，向前发力少。 动作结构：身体引拍，重心踩在右脚上，引拍蹬地转腰挥臂，在挥臂速度最大时摩擦球，重心转到左脚。 一、蹬转 二、快摩（略有手腕发力） 三、随式挥拍时重心转在左脚。 注意拍形，以摩擦为主，撞击要少。b.反手拉加转 引拍在身体下方，两腿之间，很低（近膝），由后下向前上，摩擦70%，撞击30%。 c.前冲弧圈 击球时机（高点或高点前期）和拍形角度（前倾），挥拍方向（向前多向上少）和加转不同。 击球力量：轻打，中等力量，发力拉。 常见错误：1、引拍不充分，前臂打不开，应该从下面拉。2、击球点离身体太近。3、摩擦不够，不敢压拍。d.反手前冲 力量弱些，比较突然，动作要小。肘关节略向前顶住，利用身体向前上顶，以肘为轴迅速挥拍发力。格林卡喜欢在体侧拉（便于利用转体的力量），大部分人喜欢在体前拉。 直拍横拉要注意打开前臂。e.侧弧圈 在球下降期往体侧引拍，拍头下沉，向外侧前方挥拍 兜回。 反手位使用少一些，战术策略，向侧外方挥拍，击球下降期。f.走动中拉球 跳（跨）步为主。g.拉下旋球 注意区别引拍位置更低，拍形要略上仰，挥拍向上成分多一些。注意：引拍不够向下，蹬转一定更要做好。","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"java已经没落了？","slug":"pagejava","date":"2020-04-07T06:56:59.000Z","updated":"2020-04-07T07:40:35.699Z","comments":true,"path":"2020/04/07/pagejava/","link":"","permalink":"http://yoursite.com/2020/04/07/pagejava/","excerpt":"","text":"","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"Flutter","slug":"pageflutter","date":"2020-04-07T06:56:34.000Z","updated":"2020-04-09T09:25:15.322Z","comments":true,"path":"2020/04/07/pageflutter/","link":"","permalink":"http://yoursite.com/2020/04/07/pageflutter/","excerpt":"","text":"Flutter是什么？Flutter是谷歌的移动UI框架，可以快速在iOS和Android上构建高质量的原生用户界面。 Flutter可以与现有的代码一起工作。Flutter 开源、免费，拥有宽松的开源协议，适合商业项目。 为什么要学习Flutter？从技术先进性来说：Flutter开辟了全新的思路，提供了一整套从底层渲染逻辑到上层开发语言的完整解决方案：视图渲染完全闭环在其框架内部，不依赖于底层操作系统提供的任何组件，从根本上保证了视图渲染在Android和IOS的高度一致性，Flutter的开发语言Dart，是Google专门为大前端开发量身打造的专属语言，借助于先进的工具链和编译器，成为了少数同时支持JIT和AOT的语言之一，开发调试效率高，发布期运行速度快，执行性能好，在代码执行效率上可以媲美原生APP。从生态上来说,github star 89.9k，来自谷歌，出身高贵，目前生态圈非常火爆，是真正开源框架，为什么提到一个真正，可以看看React Native诉讼协议就知道了。这与React Native所用的只能解释执行的JavaScript，又拉开了差距。阿里巴巴，今日头条、美团等用。在google的强力带动下，Flutter极有可能成为跨平台领域的终极方案。从学习曲线上来说，对于新手来说有一定难度，但对于经验丰富的Java工程师和C++工程师来说上手非常容易。 Flutter怎么学？实践出真知，还是有具体的做东西了。建议可以使用AndroidStudio+插件的方式，搭建起来还是非常方便的。","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"微信小程序","slug":"pageweixinxiaochengxu","date":"2020-04-07T06:56:17.000Z","updated":"2020-04-11T12:50:44.998Z","comments":true,"path":"2020/04/07/pageweixinxiaochengxu/","link":"","permalink":"http://yoursite.com/2020/04/07/pageweixinxiaochengxu/","excerpt":"","text":"微信小程序是什么？微信小程序是微信转型的一个突破口、利用微信本身的海量用户，为商家提供流量出口，利用其便于传播的特性易于裂变、让商家利用微信进行更好的交易。1）小程序是一种不需要下载安装即可使用的应用，它实现了应用“触手可及”的梦想；2）用户扫一扫或者搜一下即可打开应用，体现了“用完即走”的理念；3) 用户不关心是否安装太多应用的问题，应用将无处不在，随时可用，但又无需安装卸载；所以说微信小程序相对于传统的APP具有无需安装，几乎不占用内存，易于传播的特点。 小程序能干啥？小程序能干的事情比较多，比如：1）一些零售类小程序拼多多、京东购物、蘑菇街等；2）游戏类小程序：比如欢乐斗地主、跳一跳；3）内容：知乎、头条等；4）工具类：摩拜单车、滴滴打出、腾讯地图等。 小程序会不会取代APP？从用户的角度看，在一些高频的使用场景，App的地位从不动摇。一版情况下，用户每天打开使用频率最高的App不会超过10个，只有低频率的App适合小程序实现。从大型企业的角度来看，App+小程序的模式，从小程序会极大提升App活跃度，甚至会成为整个业务产品矩阵的一部分，但不会替代App。从个人和中小型企业的角度来看，小程序的研发和推广成本远远低于App，在研发初期和新业务试错环节，小程序会优于App。随着企业成熟，需求增加，功能更丰富，App优势就凸显出来了。从业务角度，如果某项业务需要短时间依附于大平台系统，借助平台的力量发展，那么小程序明显优于App。但当业务成熟并且被市场认可，平台的局限性显现出来，由小程序转向App就成为了必然。 所以，小程序不会替代App，大厂并行两条路，App负责高频场景，小程序负责拉新试错。对于创业型公司，建议从小程序开始，因为一开始就做App成本太高，但是先小程序，就可以用最低的成本去验证业务的创新性和市场接受度。如果业务上能成功，再去扩展业务模式。一些小程序死掉的原因，是因为很多人并没有搞懂小程序的持续迭代，不清楚小程序需要和场景深度结合。由于开发成本低，很快上线却缺乏维护问题，没有精心运营；另外很多开发者还没有意识到小程序和APP的去呗，只是简单的将App的功能移植过来，在产品形态上只注重功能而忽视了小程序的场景问题。最后系统不在局限于某个平台，至少是某个操作系统，甚至新型的App，要分清小程序和APP有不同的用处，要根据客群，使用频率决定小程序还是App。 小程序如何上手？1）申请账号；2）下载安装开发工具使用地图组件做了个Demo，可放大缩小，以下是截图。","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"Kotlin","slug":"pageKotlin","date":"2020-04-07T06:56:02.000Z","updated":"2020-04-07T07:41:39.263Z","comments":true,"path":"2020/04/07/pageKotlin/","link":"","permalink":"http://yoursite.com/2020/04/07/pageKotlin/","excerpt":"","text":"","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"乡村爱情","slug":"pagexiangchunaiqing","date":"2020-04-07T06:53:54.000Z","updated":"2020-04-09T01:15:50.822Z","comments":true,"path":"2020/04/07/pagexiangchunaiqing/","link":"","permalink":"http://yoursite.com/2020/04/07/pagexiangchunaiqing/","excerpt":"","text":"乡村爱情可能是中国最长寿的电视剧了吧，都12季了，当然水准也是一部不如一部，有时候感觉剧情简直太侮辱智商了，但是怎么说呢，看这个都看习惯了，每一部出来了还是快进刷刷，还是很快乐的。剧中的大部分演员也都都从清秀青涩变得脑满肠肥。先说说居中的主要人物吧，大部分主演都是生理有缺陷的人。赵四：抽抽，最早那个比较正常，乐善好义、和七哥关系比较好，最后换成这个抽嘴猥琐抠搜男，和谢广坤一样让人讨厌，据说现实中出轨女粉丝…谢广坤：秃子，本来是不秃的人，扮了个秃子，和整个世界为敌，怼天怼地对空气，演技可以，特招人恨。刘能：口吃，是乡村爱情最喜欢的角色，喜欢占小便宜，但是比较热心，乐于助人，脑子灵活，穿衣有特色、走路形态优美。刘大脑袋：跛子，存在感不强。宋晓峰：口吃、后期主要人员，爱做诗歌的结巴，小聪明，关键时刻仗义。谢永强：肥胖症、从头到尾，就是窝囊，演技全程尴尬。王长贵：救人死了，但是又来了黄世友，变成了娘娘腔，演技呵呵，太别扭了简直，侮辱智商，据说现实中…。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"老实人","slug":"pagelaoshiren","date":"2020-04-07T06:52:38.000Z","updated":"2020-04-07T07:42:08.718Z","comments":true,"path":"2020/04/07/pagelaoshiren/","link":"","permalink":"http://yoursite.com/2020/04/07/pagelaoshiren/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"鹿鼎记","slug":"pageludingji","date":"2020-04-07T06:51:41.000Z","updated":"2020-04-07T07:42:15.755Z","comments":true,"path":"2020/04/07/pageludingji/","link":"","permalink":"http://yoursite.com/2020/04/07/pageludingji/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"王阳明","slug":"pagewangyagnming","date":"2020-04-07T06:50:38.000Z","updated":"2020-04-07T07:43:28.342Z","comments":true,"path":"2020/04/07/pagewangyagnming/","link":"","permalink":"http://yoursite.com/2020/04/07/pagewangyagnming/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"胡雪岩","slug":"pagehuxuyan","date":"2020-04-07T06:50:20.000Z","updated":"2020-04-07T07:40:26.645Z","comments":true,"path":"2020/04/07/pagehuxuyan/","link":"","permalink":"http://yoursite.com/2020/04/07/pagehuxuyan/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"曾国藩","slug":"pagezengguofan","date":"2020-04-07T06:50:00.000Z","updated":"2020-04-07T07:44:27.439Z","comments":true,"path":"2020/04/07/pagezengguofan/","link":"","permalink":"http://yoursite.com/2020/04/07/pagezengguofan/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"三国演义","slug":"pagesanguoyanyi","date":"2020-04-07T06:49:30.000Z","updated":"2020-04-07T07:43:05.164Z","comments":true,"path":"2020/04/07/pagesanguoyanyi/","link":"","permalink":"http://yoursite.com/2020/04/07/pagesanguoyanyi/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"红楼梦","slug":"pagehongloumen","date":"2020-04-07T06:49:17.000Z","updated":"2020-04-07T07:40:19.614Z","comments":true,"path":"2020/04/07/pagehongloumen/","link":"","permalink":"http://yoursite.com/2020/04/07/pagehongloumen/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"水浒","slug":"pageshuihu","date":"2020-04-07T06:48:55.000Z","updated":"2020-04-07T07:43:17.084Z","comments":true,"path":"2020/04/07/pageshuihu/","link":"","permalink":"http://yoursite.com/2020/04/07/pageshuihu/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"思考快与慢","slug":"pagesikaokuaiyuman","date":"2020-04-07T06:48:41.000Z","updated":"2020-04-07T07:43:22.816Z","comments":true,"path":"2020/04/07/pagesikaokuaiyuman/","link":"","permalink":"http://yoursite.com/2020/04/07/pagesikaokuaiyuman/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"从0到1","slug":"pageconglingdaoyi","date":"2020-04-07T06:48:24.000Z","updated":"2020-04-07T07:39:35.477Z","comments":true,"path":"2020/04/07/pageconglingdaoyi/","link":"","permalink":"http://yoursite.com/2020/04/07/pageconglingdaoyi/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"自卑与缺陷","slug":"pagezibeiyuchaoyue","date":"2020-04-07T06:46:25.000Z","updated":"2020-04-07T07:44:34.689Z","comments":true,"path":"2020/04/07/pagezibeiyuchaoyue/","link":"","permalink":"http://yoursite.com/2020/04/07/pagezibeiyuchaoyue/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"Let's “go”","slug":"pagego","date":"2020-04-07T03:35:18.000Z","updated":"2020-04-07T07:40:02.443Z","comments":true,"path":"2020/04/07/pagego/","link":"","permalink":"http://yoursite.com/2020/04/07/pagego/","excerpt":"","text":"为什么要学go","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"影评-爱在系列","slug":"pageaizaixilie","date":"2020-04-07T02:52:45.000Z","updated":"2020-04-07T07:39:16.272Z","comments":true,"path":"2020/04/07/pageaizaixilie/","link":"","permalink":"http://yoursite.com/2020/04/07/pageaizaixilie/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-菊次郎的夏天","slug":"pagejucilang","date":"2020-04-07T02:26:21.000Z","updated":"2020-04-11T08:17:16.089Z","comments":true,"path":"2020/04/07/pagejucilang/","link":"","permalink":"http://yoursite.com/2020/04/07/pagejucilang/","excerpt":"","text":"在日本导演中特别喜欢北野武，除了看过他的电影，还看过他的两本书《菊次郎与佐纪》《北野武的小酒馆》，当然这部电影也如他的文字，直白且真情，笑着流出泪。 愿我们永远保持童真故事梗概：暑假来临，自幼丧父的小学生正南和奶奶生活在一起，暑假小伙伴都出去旅游了，正南特别无聊。邻居阿姨发现后，决定让自己的游手好闲的二流子老公菊次郎陪伴正南完成一次寻母之旅，在过程中发生了一系列小故事，很快夏天就过去了。最精彩的一幕，莫过于影片最后，正南问，你叫什么名字，答“他妈的，菊次郎”，看电影一直觉得是小男孩的夏天，这个时候才恍然大悟，北野武简直是开了一个不大不小的玩笑。菊次郎作为一个中年人，不务正业，行为怪癖，素质低下，但是一路上旅程，你一点也不会讨厌他，反而觉得他像一个孩子般可爱，保持着童真，当然他本质上也还是非常善良的。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"剧评-笑傲江湖","slug":"pagexiaoaojianghu","date":"2020-04-06T13:15:35.000Z","updated":"2020-04-11T07:55:13.907Z","comments":true,"path":"2020/04/06/pagexiaoaojianghu/","link":"","permalink":"http://yoursite.com/2020/04/06/pagexiaoaojianghu/","excerpt":"","text":"笑傲江湖是自己最喜欢的武侠电视剧，令狐冲最喜欢的武侠人物，很早就梦想着成为令狐冲那样的人物，仗剑走天下，行侠仗义除暴安良。 一些感悟1、对“移情别恋”的小师妹，令狐冲充满自卑，如坐针毡，手足无措；盈盈一曲《清心普善咒》让重病中的令狐冲昏沉睡去。所以遇到Ta，该吃吃，该喝喝，爱谁谁；2、年轻时看笑傲江湖，极其讨厌小师妹，觉得是自作自受；现在看笑傲江湖，特别心疼小师妹，淑女爱渣男，逃脱不掉的；3、令狐冲更爱谁？假如令狐冲和小师妹在一起会过的怎么样？感觉令狐冲还是更爱小师妹，和小师妹在一起，不如和盈盈在一起幸福；4、 恨比爱更有力量：令狐冲爱小师妹，不能让小师妹爱上自己。爱上一个人，并不能够让这个人爱自己；不过恨一个人，很有可能让对方也恨自己；5、令狐冲是最善良、最洒脱的人这告诉我们，但总被人误解冤枉，无非就是不拘小节，喜欢喝酒吗？所以大部分人都是睁眼瞎子纠结小是小非；6、岳不群的例子告诉我们，伪君子是最可怕也最难辨别，一个人满嘴仁义道德，完美的不像的人的人，没有一丝缺点，那他极有可能就是一个伪君子；7、没有绝对正派和反派，就是国外西方势力将中国丑化成魔教一样，他们整天满嘴仁义道德，什么人权什么民主呢？本次疫情人权哪儿去了，民主有哪儿去了？","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"剧评-孤鸽镇","slug":"pagegugezhen","date":"2020-04-06T12:47:48.000Z","updated":"2020-04-11T08:17:52.542Z","comments":true,"path":"2020/04/06/pagegugezhen/","link":"","permalink":"http://yoursite.com/2020/04/06/pagegugezhen/","excerpt":"","text":"一直都特别喜欢西部电影，豆瓣上评分8分以上的西部电影能看的都看了，最后找不到了电影了，看了这部迷你剧，简直不要太精彩，5星好评，评五星是因为最多只能评五星。 英雄人人都喜欢1、画面，虽然是1989年拍的，但是画面非常精美，大气磅礴；2、剧情衔接非常紧凑，惊心动魄，套用大家看NBA比赛用的粗话，这电视剧绝对看得人菊花似紧；3、配乐，悲壮苍凉，和西部那种拓荒征服的感觉太契合了；4、演员的表演，杜瓦尔表演太出色了，那种豪气英雄气简直井喷，虽然杜瓦尔格子不高，但他扮演的gus给人的感觉就是很高大威武；还有沉默寡言的琼斯扮演的Call，关键时候总能让人安心；5、电影中所表现出英雄气概，承诺精神无与伦比，千里追凶，千里送尸。另外听说李安的《断背山》就是从这个原著中摘出来的。一个男孩想成长为男人吧，这部电视剧绝对推荐。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"如果阅读一本书","slug":"pageruheyueduyibenshu","date":"2020-04-06T12:37:02.000Z","updated":"2020-04-08T13:23:24.969Z","comments":true,"path":"2020/04/06/pageruheyueduyibenshu/","link":"","permalink":"http://yoursite.com/2020/04/06/pageruheyueduyibenshu/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"你的灯亮着吗？","slug":"pagenidedengliagnzhuomei","date":"2020-04-06T12:34:24.000Z","updated":"2020-04-08T13:20:32.082Z","comments":true,"path":"2020/04/06/pagenidedengliagnzhuomei/","link":"","permalink":"http://yoursite.com/2020/04/06/pagenidedengliagnzhuomei/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"刻意练习","slug":"pagekeyilianxi","date":"2020-04-06T12:31:38.000Z","updated":"2020-04-11T08:09:47.637Z","comments":true,"path":"2020/04/06/pagekeyilianxi/","link":"","permalink":"http://yoursite.com/2020/04/06/pagekeyilianxi/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-小妇人（1994）","slug":"pagexiaofuren","date":"2020-04-06T11:51:46.000Z","updated":"2020-04-11T08:10:47.216Z","comments":true,"path":"2020/04/06/pagexiaofuren/","link":"","permalink":"http://yoursite.com/2020/04/06/pagexiaofuren/","excerpt":"","text":"看了94版《小妇人》，太赞了，5星好评。 温馨的家庭真好马齐先生从军，马齐太太一个人带着四个女孩，四个不同性格的孩子。老大端庄美丽，老二活泼急躁，老三腼腆害羞，老四乖巧。虽然家里条件不好，但马齐太太总是充满正能量，鼓励他们追求梦想，温柔善良，并且接济比她们很苦的人，一家人太温馨了。太喜欢乔了，独立自强，虽然像个男孩，但善良且爱自己的家人，为了父亲剪掉了自己的头发，为了梅格，为了贝丝，为了艾米，她做的太棒了。包括因病去世的贝丝，大家的结局都算完美。一个家庭里的女主人太重要了，是家里的气氛的调节器，马齐太太真的伟大。温馨的家庭真好。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"金字塔原理","slug":"pagejinzitayuanli","date":"2020-04-06T08:18:29.000Z","updated":"2020-04-11T08:06:36.440Z","comments":true,"path":"2020/04/06/pagejinzitayuanli/","link":"","permalink":"http://yoursite.com/2020/04/06/pagejinzitayuanli/","excerpt":"","text":"","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"大道至简-python之道","slug":"pagewhypython","date":"2020-04-06T08:16:24.000Z","updated":"2020-04-07T07:43:39.644Z","comments":true,"path":"2020/04/06/pagewhypython/","link":"","permalink":"http://yoursite.com/2020/04/06/pagewhypython/","excerpt":"","text":"","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"设计模式","slug":"pageshejimoshi","date":"2020-04-06T08:15:11.000Z","updated":"2020-04-11T07:54:02.058Z","comments":true,"path":"2020/04/06/pageshejimoshi/","link":"","permalink":"http://yoursite.com/2020/04/06/pageshejimoshi/","excerpt":"","text":"","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"程序内存","slug":"pagememory","date":"2020-04-06T08:14:06.000Z","updated":"2020-04-07T07:42:21.703Z","comments":true,"path":"2020/04/06/pagememory/","link":"","permalink":"http://yoursite.com/2020/04/06/pagememory/","excerpt":"","text":"","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"JNI(Java Native Interface)","slug":"pagejni","date":"2020-04-06T08:10:55.000Z","updated":"2020-04-07T07:40:46.650Z","comments":true,"path":"2020/04/06/pagejni/","link":"","permalink":"http://yoursite.com/2020/04/06/pagejni/","excerpt":"","text":"","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"}]},{"title":"影评-血战钢锯岭","slug":"pagegangjuling","date":"2020-04-06T07:46:30.000Z","updated":"2020-04-11T13:03:45.703Z","comments":true,"path":"2020/04/06/pagegangjuling/","link":"","permalink":"http://yoursite.com/2020/04/06/pagegangjuling/","excerpt":"","text":"五星好评，战争场面逼真，人物故事感人。 包容血战钢锯岭，讲述了一个士兵因为自己的家庭经历及信仰，不愿意拿枪，从而遭受着其他战士们的排挤和欺负。在战争中，他仍坚守自己的信仰及原则，无惧枪林弹雨和凶残日军，拯救自己的战友，75名受伤战友最终被奇迹般的运送至安全之地，得以生还。电影真不错，感触最深的还是对于别人的尊重，包括对信仰的尊重。需要包容的眼光去对待人和事，在生活中好多人，遇到芝麻绿豆般小事，只要意见相左，就吹胡子瞪眼，如果大家都能多一分包容和理解，世界该多美好啊。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"影评-一个叫欧维的人决定去死","slug":"pagejuedingqusi","date":"2020-04-05T12:37:14.000Z","updated":"2020-04-11T13:03:45.703Z","comments":true,"path":"2020/04/05/pagejuedingqusi/","link":"","permalink":"http://yoursite.com/2020/04/05/pagejuedingqusi/","excerpt":"","text":"独自面对死亡给了5星好评，直接使用同名原著的话“死亡是一桩奇怪的事情。人们终其一生都在假装它并不存在，尽管这是生命的最大动机之一。我们其中一些人有足够时间认识死亡，他们得以活得更努力、更执着、更壮烈。有些人却要等到它真正逼近时才意识到它的反义词有多美好。另一些人深受其困扰，在它宣布到来之前就早早地坐进等候室。我们害怕它，但我们更害怕它发生在身边的人身上。对死亡最大的恐惧，在于它与我们擦肩而过，留下我们独自一人。”","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"程序员英语","slug":"pagechegnxuyuanyingyu","date":"2020-04-05T09:14:51.000Z","updated":"2020-04-07T07:39:24.204Z","comments":true,"path":"2020/04/05/pagechegnxuyuanyingyu/","link":"","permalink":"http://yoursite.com/2020/04/05/pagechegnxuyuanyingyu/","excerpt":"","text":"最近刚好读一本之前买的《程序员的英语》一书，特开一博记录下书中不熟悉的单词吧。 第1课","categories":[],"tags":[{"name":"英语","slug":"英语","permalink":"http://yoursite.com/tags/%E8%8B%B1%E8%AF%AD/"}]},{"title":"影评-恋爱笔记本","slug":"pagelainaibijiben","date":"2020-04-05T08:41:36.000Z","updated":"2020-04-11T13:03:45.703Z","comments":true,"path":"2020/04/05/pagelainaibijiben/","link":"","permalink":"http://yoursite.com/2020/04/05/pagelainaibijiben/","excerpt":"","text":"本来不喜欢看爱情片，一直比较喜欢看悬疑片和西部片，今天打开优酷不小心点了这部片，看完后，感觉还不错，谨记。 爱孩子最好的方式就是爱她的妈妈其实电影和上面的标题关系不大，电影里面有一句台词“your mother is home”特别令人感动，一般夫妇从相识、相恋、结婚，再到被琐事困扰，然后生厌，最后离婚。所以这个故事虽然比较俗套，但从一见钟情直到相依而死，可能只能在电影中才会出现吧，也可能是我们常人的爱情本身不够圆满，我们爱的不够深。看到“your mother is home”我就想到了家庭。很多家庭在有孩子之前，夫妻关系是甜蜜温馨的，而有了孩子之后，亲子关系慢慢开始超越了夫妻了关系。孩子总是第一位的，夫妻间除了谈论孩子之外，几乎没有其他亲密的沟通，为了孩子而活，当亲子关系高于夫妻关系时，家庭往往会出问题。本来就身心疲惫的妈妈更容易情绪失控，或多或少也会把这种情绪发泄在孩子身上。敏感的孩子能捕捉到父母的情绪，在这种环境下成长的孩子，往往容易有很大的心理压力，孩子的性格容易敏感、急躁、多疑、内心极度缺乏安全感。所以爱你的孩子，想要他健康成长，最好的方式就是爱她的妈妈。不好意思，写跑题了。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"英语20204第一周","slug":"page20200404yingyu","date":"2020-04-04T12:54:05.000Z","updated":"2020-04-07T07:38:30.888Z","comments":true,"path":"2020/04/04/page20200404yingyu/","link":"","permalink":"http://yoursite.com/2020/04/04/page20200404yingyu/","excerpt":"2020/4/5Mandarin /ˈmæn.dɚ.ɪn/ n. 中国的国语，普通话；同义短语：Mandarin Chinese radically ˈ/ræd.ɪ.kəl.i/ adv. 彻底完全地 相关词汇：radical（adj. 根本的）；搭配短语：radical differences，radical changes affirm /əˈfɝːm/ v. 证实，确认，断言 exclamation /ek.skləˈmeɪ.ʃən/ n.（因吃惊、喜悦等而发出的）呼喊，惊叫;搭配短语：exclamation pointobjectionable /əbˈdʒek.ʃən.ə.bəl/ adj. 令人反感的，使人不快的 sober /ˈsoʊ.bɚ/ aadj. 严肃的，冷静的；未醉的; 反义词：drunk（adj. 喝醉的） connotation /ˌkɑː.nəˈteɪ.ʃən/ n. 内涵意义，隐含意义，联想意义 fastidious /fæsˈtɪd.i.əs/ adj. 过分严谨的，苛求的，讲究的 dweller /ˈdwel.ɚ/ n. 居民，栖身者 相关词汇：dwell（v. 居住）; 近义词：liveaddress /ˈæd.res/ n. 称呼;词性拓展：address（v. 称呼）;搭配短语：address sb seminal /ˈsem.ə.nəl/adj. 具有开拓性的，有深远影响的 linguistic /lɪŋˈɡwɪs.tɪk/ adj. 语言的，语言学的;相关词汇：linguistics（n. 语言学）laid-back /ˌleɪdˈbæk/ adj. 轻松的，悠闲的，不着急的camaraderie /ˌkæm.əˈrɑː.dɚ.i/ n. 同志情谊，友情deploy /dɪˈplɔɪ/ v. 有效运用，发挥 … 的作用；部署mitigate /ˈmɪt̬.ə.ɡeɪt/ v. 使缓和，减轻（危害等）acquaintance /əˈkweɪn.təns/ n. 相识的人，熟人a variation on a theme 围绕某一主题的变奏曲；同一事物略微的变化形式;相关词汇：variation（n. 变奏曲） 2020/4/4incense /ɪnˈsens/ v. 激怒，使某人十分愤怒，搭配短语：be incensed by/at sth.ordeal /ɔːrˈdɪəl/ n.（尤指长期的）煎熬，磨难graphic /ˈɡræf.ɪk/ adj. 露骨的；与图表相关的；详细的，生动的；相关词汇：graph（n. 图表，坐标图，曲线图）；搭配短语：graphic information（与图表相关的）a graphic description of a battle（详细的，生动的）apparent /əˈper.ənt/ adj. 清晰的，明显的；近义词：obvious","text":"2020/4/5Mandarin /ˈmæn.dɚ.ɪn/ n. 中国的国语，普通话；同义短语：Mandarin Chinese radically ˈ/ræd.ɪ.kəl.i/ adv. 彻底完全地 相关词汇：radical（adj. 根本的）；搭配短语：radical differences，radical changes affirm /əˈfɝːm/ v. 证实，确认，断言 exclamation /ek.skləˈmeɪ.ʃən/ n.（因吃惊、喜悦等而发出的）呼喊，惊叫;搭配短语：exclamation pointobjectionable /əbˈdʒek.ʃən.ə.bəl/ adj. 令人反感的，使人不快的 sober /ˈsoʊ.bɚ/ aadj. 严肃的，冷静的；未醉的; 反义词：drunk（adj. 喝醉的） connotation /ˌkɑː.nəˈteɪ.ʃən/ n. 内涵意义，隐含意义，联想意义 fastidious /fæsˈtɪd.i.əs/ adj. 过分严谨的，苛求的，讲究的 dweller /ˈdwel.ɚ/ n. 居民，栖身者 相关词汇：dwell（v. 居住）; 近义词：liveaddress /ˈæd.res/ n. 称呼;词性拓展：address（v. 称呼）;搭配短语：address sb seminal /ˈsem.ə.nəl/adj. 具有开拓性的，有深远影响的 linguistic /lɪŋˈɡwɪs.tɪk/ adj. 语言的，语言学的;相关词汇：linguistics（n. 语言学）laid-back /ˌleɪdˈbæk/ adj. 轻松的，悠闲的，不着急的camaraderie /ˌkæm.əˈrɑː.dɚ.i/ n. 同志情谊，友情deploy /dɪˈplɔɪ/ v. 有效运用，发挥 … 的作用；部署mitigate /ˈmɪt̬.ə.ɡeɪt/ v. 使缓和，减轻（危害等）acquaintance /əˈkweɪn.təns/ n. 相识的人，熟人a variation on a theme 围绕某一主题的变奏曲；同一事物略微的变化形式;相关词汇：variation（n. 变奏曲） 2020/4/4incense /ɪnˈsens/ v. 激怒，使某人十分愤怒，搭配短语：be incensed by/at sth.ordeal /ɔːrˈdɪəl/ n.（尤指长期的）煎熬，磨难graphic /ˈɡræf.ɪk/ adj. 露骨的；与图表相关的；详细的，生动的；相关词汇：graph（n. 图表，坐标图，曲线图）；搭配短语：graphic information（与图表相关的）a graphic description of a battle（详细的，生动的）apparent /əˈper.ənt/ adj. 清晰的，明显的；近义词：obvious rock /rɑːk/ v. 使人震惊，使人苦恼；剧烈震动，摇晃;词性拓展：rock music（n. 摇滚乐）plight /plaɪt/ n. 困境;词义辨析：plight, ordeal,两者都可以用来表示“磨难，苦难”。但 plight 强调困难的严重性，而 ordeal 则强调长期性。stand accused of 被指控犯下…的罪行;相关词汇：accuse（v. 指控，控告）;同义短语：be accused of;相关词汇：stand（v.（使）处于…的状态）,搭配短语：to stand trial（受审）extort /ɪkˈstɔːrt/ v. 强行索取，勒索，敲诈;词义辨析：extort, blackmail;extort 和 blackmail 都可以表示“敲诈，勒索”。但 blackmail 强调是以公开具有破坏性的信息的方式来威胁他人，而 extort 更偏向于使用暴力威胁，或者是在双方权力悬殊的情况下进行威胁勒索。blackmail 可以视为 extort 的其中一种方式。keen /kiːn/ adj. 渴望的，迫切的crack down 打击，处罚; 搭配短语：crack down on sth.stern /stɝːn/ adj. 严厉的，严苛的；表情严肃的；严峻的（竞争），严酷的（挑战）;近义词：hard;搭配短语：a stern face/expression/look（表情严肃的）fury /ˈfjʊr.i/ n. 愤怒；愤怒的状态; 搭配短语：in a furyjustified /ˈdʒʌs.tə.faɪd/ adj. 合理的，正当的hand-wringing /ˈhændˌrɪŋɪŋ/ n. 焦虑，担忧，痛苦; 相关词汇：wring（v. 拧，攥紧);搭配短语：wring one’s handssketchy /ˈsketʃ.i/ adj. 粗略完成的；草草了事的，敷衍的;相关词汇：sketch（n. 速写，草图）prosecute /ˈprɑː.sə.kjuːt/ v. 起诉，检举misogyny /mɪˈsɑː.dʒən.i/ n. 厌女症; 反义词：misandry（n. 厌男症）;文化拓展：misogyny 和 misandry 均来自希腊语。entrench /ɪnˈtrentʃ/ v. 牢牢巩固，使…根深蒂固；将…安置于壕沟;相关词汇：trench（n. 壕沟，战壕）;词根词缀：en-（构成动词）;派生词：entrenched（adj. 根深蒂固的）;搭配短语：entrenched bureaucracythe best of intentions 一片好心；最好的打算stamp out 杜绝，打击；踩灭; 相关词汇：stamp（v. 踩，跺脚）wild-goose chase 白费力气，徒劳无功;文化补充：俗语 wild-goose chase 源于 16 世纪一种赛马比赛的名称。比赛中，骑手们需要追赶一匹头马，比赛的阵形很像飞在天上的雁群，所以这种比赛被称为 wild-goose chase（“追野鹅”）。莎士比亚在《罗密欧与朱丽叶》里，第一次使用了 wild-goose chase 来比喻徒劳无功的事情。perpetrator /ˈpɝː.pə.treɪ.t̬ɚ/n. 罪犯;词义辨析：perpetrator, criminal, offender 使用 perpetrator 来讨论罪犯时，语境中通常会出现具体的罪行。criminal 则泛指犯下罪行，将要受到法律制裁的犯人。offender 可以指代任何违反法律的人，即“违法者”。offender 并不一定会被判为“罪犯”，也并不一定会受到法律的制裁。","categories":[],"tags":[{"name":"英语","slug":"英语","permalink":"http://yoursite.com/tags/%E8%8B%B1%E8%AF%AD/"}]},{"title":"影评-初恋这件小事","slug":"chulianxiaoshi","date":"2020-04-04T12:19:27.000Z","updated":"2020-04-11T07:51:21.533Z","comments":true,"path":"2020/04/04/chulianxiaoshi/","link":"","permalink":"http://yoursite.com/2020/04/04/chulianxiaoshi/","excerpt":"","text":"以前好像没有看过泰国电影，今天开博客，恰好看了部电影，谨记。 青春再来一次多好电影故事并不算太新颖，丑小鸭（开始实在是太丑了）为了喜欢的人，努力上进，经过蜕变，变得很优秀，经过一番磨难，最后两人终于在一起了，但整体节奏很好。我们每个人都有过青春，每个年代每个地域的处理方式都不同，只悔恨当时我们的方式是男女授受不亲，喜欢哪个女孩便向她吐口水，扔石头，装着很讨厌的样子，假如青春再来一次多好。","categories":[],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"}]},{"title":"正确的深蹲","slug":"shendun","date":"2020-04-04T12:02:15.000Z","updated":"2020-04-11T07:55:54.146Z","comments":true,"path":"2020/04/04/shendun/","link":"","permalink":"http://yoursite.com/2020/04/04/shendun/","excerpt":"","text":"已经练习了好几个月的深蹲，发现腿变粗了很多，体重也上去了，越来越感觉不好。 正确的深蹲有句老话：腿有多老，人就有多老。下身力量的流失可以延缓，甚至可以逆转，但是无论做多少的上身训练也起不到这样的作用。你需要学习如何锻炼双腿，深蹲一个完美的解决方案！①两腿与肩同宽站立。②蹲下和上升过程中背部始终挺直。千万不要弓背。当背是直的时候，你的腿就会承担身体的所有重量。但是如果你弓背了，所有的重量就会移到你的上半身和下背部，对背部造成损伤。③蹲到停止点时，臀部要低于膝盖。④站起时重心微微后倾。千万不要让膝盖超过脚尖，这样会对膝盖造成很大的伤害。","categories":[],"tags":[{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]},{"title":"个人网站正式开通","slug":"frist","date":"2020-04-04T10:58:37.566Z","updated":"2020-04-04T10:58:37.566Z","comments":true,"path":"2020/04/04/frist/","link":"","permalink":"http://yoursite.com/2020/04/04/frist/","excerpt":"","text":"除了工作，要坚持做三件事：阅读、写作和健身。本博客主要记录日常点滴，目前主要分为以下几类： 英语学习虽然平常工作中英语用的还算多，但也仅限于看看技术文档，没有经过刻意练习，词汇量、口语、听力都一直没有进步，最近特意开通了流利阅读会员，以后会定期将阅读中新词汇更新在博客中，以周为单位进行更新。 感悟包括读书心得、观影心得及其他。 技术主要针对工作中使用的一些技术、遇到的一些坑进行总结。 健身主要记录日常健身相关。","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"英语","slug":"英语","permalink":"http://yoursite.com/tags/%E8%8B%B1%E8%AF%AD/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/%E6%84%9F%E6%82%9F/"},{"name":"ganwu","slug":"ganwu","permalink":"http://yoursite.com/tags/ganwu/"},{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/%E6%8A%80%E6%9C%AF/"},{"name":"健身","slug":"健身","permalink":"http://yoursite.com/tags/%E5%81%A5%E8%BA%AB/"}]}